----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chadi\OneDrive - HandelshÃ¶gskolan i Stockholm\Econ\resources\econometrics\textbooks\datacode\MostlyHarmless\angrist\stabu.log
  log type:  text
 opened on:  23 Jun 2024, 04:48:20

. 
. /* prepare aggregate data from German statistical office to present results on
>    grade repetition and secondary track choice */
. 
. 
. clear

. 
. 
. use graderep

. 
. for var stud* repeat*: replace X = . if X == 0

->  replace stud1 = . if stud1 == 0
(0 real changes made)

->  replace stud2 = . if stud2 == 0
(0 real changes made)

->  replace stud3 = . if stud3 == 0
(0 real changes made)

->  replace stud4 = . if stud4 == 0
(0 real changes made)

->  replace repeat1 = . if repeat1 == 0
(0 real changes made)

->  replace repeat2 = . if repeat2 == 0
(0 real changes made)

->  replace repeat3 = . if repeat3 == 0
(0 real changes made)

->  replace repeat4 = . if repeat4 == 0
(0 real changes made)

. 
. /* grade repetition rates */
. 
. gen rq1 = repeat1/stud1
(35 missing values generated)

. gen rq2 = repeat2/stud2
(35 missing values generated)

. gen rq3 = repeat3/stud3
(35 missing values generated)

. gen rq4 = repeat4/stud4
(35 missing values generated)

. 
. replace rq4 = . if bula=="saar" & year==1961
(1 real change made, 1 to missing)

. 
. save temp, replace
file temp.dta saved

. 
. /* collapse data for grade repetition graphs */
. 
. drop if bula=="ns"
(12 observations deleted)

. gen treat = 1                                           /* short school year states */

. replace treat = 2 if bula=="bay"                        /* Bavaria with no transition */
(12 real changes made)

. replace treat = 3 if bula=="ber" | bula=="hh"           /* Berlin/Hamburg with no short school years */
(24 real changes made)

. 
. collapse (sum) repeat1-repeat4 stud1-stud4, by(year treat)

. 
. for var repeat*: replace X = . if year >= 1962 & year <= 1964

->  replace repeat1 = . if year >= 1962 & year <= 1964
(9 real changes made, 9 to missing)

->  replace repeat2 = . if year >= 1962 & year <= 1964
(9 real changes made, 9 to missing)

->  replace repeat3 = . if year >= 1962 & year <= 1964
(9 real changes made, 9 to missing)

->  replace repeat4 = . if year >= 1962 & year <= 1964
(9 real changes made, 9 to missing)

. 
. gen rq1 = repeat1/stud1
(9 missing values generated)

. gen rq2 = repeat2/stud2
(9 missing values generated)

. gen rq3 = repeat3/stud3
(9 missing values generated)

. gen rq4 = repeat4/stud4
(9 missing values generated)

. 
. format rq* %8.3f

. l year rq* if treat==1

     +--------------------------------------+
     | year     rq1     rq2     rq3     rq4 |
     |--------------------------------------|
  1. | 1961   0.044   0.045   0.037   0.037 |
  4. | 1962       .       .       .       . |
  7. | 1963       .       .       .       . |
 10. | 1964       .       .       .       . |
 13. | 1965   0.045   0.044   0.036   0.034 |
     |--------------------------------------|
 16. | 1966   0.045   0.053   0.040   0.037 |
 19. | 1967   0.047   0.057   0.046   0.043 |
 22. | 1968   0.048   0.049   0.049   0.048 |
 25. | 1969   0.053   0.044   0.038   0.045 |
 28. | 1970   0.053   0.042   0.032   0.032 |
     |--------------------------------------|
 31. | 1971   0.055   0.042   0.032   0.027 |
 34. | 1972   0.055   0.040   0.031   0.025 |
     +--------------------------------------+

. l year rq* if treat==2

     +--------------------------------------+
     | year     rq1     rq2     rq3     rq4 |
     |--------------------------------------|
  2. | 1961   0.037   0.024   0.019   0.014 |
  5. | 1962       .       .       .       . |
  8. | 1963       .       .       .       . |
 11. | 1964       .       .       .       . |
 14. | 1965   0.036   0.026   0.020   0.014 |
     |--------------------------------------|
 17. | 1966   0.038   0.026   0.021   0.015 |
 20. | 1967   0.040   0.028   0.020   0.015 |
 23. | 1968   0.037   0.026   0.019   0.015 |
 26. | 1969   0.038   0.027   0.018   0.016 |
 29. | 1970   0.039   0.027   0.019   0.017 |
     |--------------------------------------|
 32. | 1971   0.040   0.026   0.017   0.015 |
 35. | 1972   0.041   0.024   0.015   0.013 |
     +--------------------------------------+

. l year rq* if treat==3

     +--------------------------------------+
     | year     rq1     rq2     rq3     rq4 |
     |--------------------------------------|
  3. | 1961   0.051   0.063   0.054   0.054 |
  6. | 1962       .       .       .       . |
  9. | 1963       .       .       .       . |
 12. | 1964       .       .       .       . |
 15. | 1965   0.037   0.052   0.043   0.040 |
     |--------------------------------------|
 18. | 1966   0.029   0.048   0.039   0.034 |
 21. | 1967   0.007   0.015   0.018   0.015 |
 24. | 1968   0.034   0.043   0.028   0.030 |
 27. | 1969   0.033   0.048   0.034   0.025 |
 30. | 1970   0.034   0.044   0.032   0.027 |
     |--------------------------------------|
 33. | 1971   0.037   0.044   0.034   0.029 |
 36. | 1972   0.035   0.043   0.029   0.027 |
     +--------------------------------------+

. 
. 
. /* reshape data for regressions of grade repetition */
. 
. clear

. set matsize 400

. use temp

. 
. drop if year >= 1962 & year <= 1964
(33 observations deleted)

. 
. reshape groups grade 1-4

. reshape vars rq stud

. reshape cons bula year

. reshape long

. 
. 
. 
. /* year is when school year starts */
. 
. gen ksj = 0

. replace ksj = 1 if year == 1966
(44 real changes made)

. replace ksj = 1 if year == 1967 & grade >= 2
(33 real changes made)

. replace ksj = 1 if year == 1968 & grade >= 3
(22 real changes made)

. replace ksj = 1 if year == 1969 & grade == 4
(11 real changes made)

. replace ksj = 0 if bula=="bay" | bula=="ber" | bula=="hh"
(30 real changes made)

. 
. gen ksj2 = ksj

. replace ksj2 = 0 if bula=="ns"
(10 real changes made)

. 
. gen ns = bula=="ns"

. gen ber = bula=="ber"

. 
. sum rq [aw=stud]

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
          rq |     387    32550503    .0380653    .014927   .0063186   .0830906

. xi: reg rq ksj i.bula i.grade i.year [aw=stud]
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
(sum of wgt is 32,550,503)

      Source |       SS           df       MS      Number of obs   =       387
-------------+----------------------------------   F(22, 364)      =     42.38
       Model |  .061856898        22  .002811677   Prob > F        =    0.0000
    Residual |  .024149591       364  .000066345   R-squared       =    0.7192
-------------+----------------------------------   Adj R-squared   =    0.7022
       Total |  .086006489       386  .000222815   Root MSE        =    .00815

------------------------------------------------------------------------------
          rq | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         ksj |   .0094378   .0017065     5.53   0.000      .006082    .0127936
    _Ibula_2 |   .0242494   .0029915     8.11   0.000     .0183667    .0301321
    _Ibula_3 |   .0011946   .0015029     0.79   0.427    -.0017609    .0041502
    _Ibula_4 |   .0066321   .0041022     1.62   0.107    -.0014348     .014699
    _Ibula_5 |   .0080297   .0017874     4.49   0.000     .0045148    .0115445
    _Ibula_6 |   .0019847   .0027687     0.72   0.474      -.00346    .0074293
    _Ibula_7 |   .0218809    .001321    16.56   0.000     .0192831    .0244786
    _Ibula_8 |   .0075954   .0015802     4.81   0.000     .0044878    .0107029
    _Ibula_9 |   .0201883   .0019316    10.45   0.000     .0163897    .0239868
   _Ibula_10 |   .0121785   .0030882     3.94   0.000     .0061057    .0182514
   _Ibula_11 |   .0321975   .0023016    13.99   0.000     .0276713    .0367236
   _Igrade_2 |   -.002923   .0011563    -2.53   0.012    -.0051968   -.0006492
   _Igrade_3 |   -.014093   .0011957   -11.79   0.000    -.0164442   -.0117417
   _Igrade_4 |  -.0155246   .0012511   -12.41   0.000    -.0179849   -.0130644
 _Iyear_1965 |  -.0019527   .0018477    -1.06   0.291    -.0055863    .0016809
 _Iyear_1966 |  -.0077939   .0022631    -3.44   0.001    -.0122442   -.0033436
 _Iyear_1967 |  -.0036312   .0021052    -1.72   0.085    -.0077712    .0005087
 _Iyear_1968 |  -.0031355   .0019355    -1.62   0.106    -.0069416    .0006705
 _Iyear_1969 |  -.0030201   .0018479    -1.63   0.103    -.0066539    .0006138
 _Iyear_1970 |  -.0040425     .00179    -2.26   0.025    -.0075625   -.0005225
 _Iyear_1971 |  -.0043295   .0017741    -2.44   0.015    -.0078183   -.0008407
 _Iyear_1972 |  -.0060078    .001773    -3.39   0.001    -.0094945   -.0025212
       _cons |   .0366045    .001829    20.01   0.000     .0330077    .0402013
------------------------------------------------------------------------------

. xi: reg rq ksj2 i.bula i.grade i.year [aw=stud]
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
(sum of wgt is 32,550,503)

      Source |       SS           df       MS      Number of obs   =       387
-------------+----------------------------------   F(22, 364)      =     44.59
       Model |  .062730097        22  .002851368   Prob > F        =    0.0000
    Residual |  .023276392       364  .000063946   R-squared       =    0.7294
-------------+----------------------------------   Adj R-squared   =    0.7130
       Total |  .086006489       386  .000222815   Root MSE        =      .008

------------------------------------------------------------------------------
          rq | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ksj2 |    .011005   .0016335     6.74   0.000     .0077928    .0142172
    _Ibula_2 |   .0242487   .0029364     8.26   0.000     .0184742    .0300232
    _Ibula_3 |   .0008218   .0014718     0.56   0.577    -.0020724     .003716
    _Ibula_4 |   .0062368   .0040259     1.55   0.122    -.0016802    .0141538
    _Ibula_5 |   .0076244   .0017515     4.35   0.000     .0041801    .0110687
    _Ibula_6 |   .0019868   .0027182     0.73   0.465    -.0033585    .0073321
    _Ibula_7 |    .021479   .0012925    16.62   0.000     .0189374    .0240206
    _Ibula_8 |   .0093909   .0015098     6.22   0.000     .0064219    .0123599
    _Ibula_9 |   .0197908   .0018934    10.45   0.000     .0160674    .0235142
   _Ibula_10 |   .0117491   .0030301     3.88   0.000     .0057903    .0177079
   _Ibula_11 |   .0318112   .0022568    14.10   0.000     .0273732    .0362493
   _Igrade_2 |  -.0028982   .0011322    -2.56   0.011    -.0051247   -.0006716
   _Igrade_3 |  -.0140491   .0011627   -12.08   0.000    -.0163355   -.0117627
   _Igrade_4 |  -.0154728   .0012039   -12.85   0.000    -.0178403   -.0131054
 _Iyear_1965 |  -.0019413    .001814    -1.07   0.285    -.0055086     .001626
 _Iyear_1966 |  -.0077888   .0021101    -3.69   0.000    -.0119383   -.0036392
 _Iyear_1967 |  -.0036773   .0020033    -1.84   0.067    -.0076168    .0002623
 _Iyear_1968 |  -.0032035   .0018766    -1.71   0.089    -.0068938    .0004868
 _Iyear_1969 |  -.0031759   .0018122    -1.75   0.081    -.0067396    .0003877
 _Iyear_1970 |  -.0040472   .0017573    -2.30   0.022    -.0075029   -.0005914
 _Iyear_1971 |  -.0043229   .0017417    -2.48   0.014    -.0077481   -.0008978
 _Iyear_1972 |  -.0060006   .0017407    -3.45   0.001    -.0094237   -.0025776
       _cons |   .0366037   .0017713    20.66   0.000     .0331204    .0400869
------------------------------------------------------------------------------

. xi: reg rq ksj i.bula i.grade i.year if ns==0  [aw=stud]
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
(sum of wgt is 28,671,128)

      Source |       SS           df       MS      Number of obs   =       355
-------------+----------------------------------   F(21, 333)      =     91.30
       Model |  .064376364        21  .003065541   Prob > F        =    0.0000
    Residual |  .011181252       333  .000033577   R-squared       =    0.8520
-------------+----------------------------------   Adj R-squared   =    0.8427
       Total |  .075557616       354   .00021344   Root MSE        =    .00579

------------------------------------------------------------------------------
          rq | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         ksj |   .0111956   .0012428     9.01   0.000     .0087509    .0136402
    _Ibula_2 |   .0242344   .0020858    11.62   0.000     .0201314    .0283374
    _Ibula_3 |   .0007754   .0010515     0.74   0.461    -.0012931    .0028439
    _Ibula_4 |   .0062389   .0028612     2.18   0.030     .0006105    .0118672
    _Ibula_5 |   .0076054   .0012497     6.09   0.000     .0051471    .0100637
    _Ibula_6 |   .0019397   .0019301     1.00   0.316     -.001857    .0057365
    _Ibula_7 |   .0215068   .0009259    23.23   0.000     .0196856    .0233281
    _Ibula_8 |          0  (omitted)
    _Ibula_9 |   .0198355   .0013499    14.69   0.000     .0171801    .0224908
   _Ibula_10 |   .0117431   .0021551     5.45   0.000     .0075038    .0159824
   _Ibula_11 |   .0317739   .0016072    19.77   0.000     .0286123    .0349355
   _Igrade_2 |  -.0057842   .0008574    -6.75   0.000    -.0074708   -.0040976
   _Igrade_3 |  -.0149797   .0008841   -16.94   0.000    -.0167189   -.0132405
   _Igrade_4 |  -.0180673    .000923   -19.57   0.000     -.019883   -.0162516
 _Iyear_1965 |  -.0011404   .0013773    -0.83   0.408    -.0038496    .0015689
 _Iyear_1966 |   -.006053   .0016513    -3.67   0.000    -.0093014   -.0028046
 _Iyear_1967 |  -.0007387   .0015542    -0.48   0.635     -.003796    .0023187
 _Iyear_1968 |   .0009831   .0014359     0.68   0.494    -.0018415    .0038077
 _Iyear_1969 |   .0005586    .001373     0.41   0.684    -.0021422    .0032594
 _Iyear_1970 |  -.0008272    .001336    -0.62   0.536    -.0034553    .0018009
 _Iyear_1971 |  -.0014537   .0013229    -1.10   0.273     -.004056    .0011486
 _Iyear_1972 |  -.0032122   .0013221    -2.43   0.016    -.0058129   -.0006115
       _cons |    .035597   .0013341    26.68   0.000     .0329728    .0382213
------------------------------------------------------------------------------

. 
. xi: reg rq ksj i.bula*i.grade i.year [aw=stud]
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.bula*i.grade    _IbulXgra_#_#       (coded as above)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
(sum of wgt is 32,550,503)

      Source |       SS           df       MS      Number of obs   =       387
-------------+----------------------------------   F(52, 334)      =     26.22
       Model |  .069082085        52  .001328502   Prob > F        =    0.0000
    Residual |  .016924404       334  .000050672   R-squared       =    0.8032
-------------+----------------------------------   Adj R-squared   =    0.7726
       Total |  .086006489       386  .000222815   Root MSE        =    .00712

--------------------------------------------------------------------------------
            rq | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
           ksj |   .0089515   .0015225     5.88   0.000     .0059566    .0119464
      _Ibula_2 |   .0151344   .0049995     3.03   0.003        .0053    .0249688
      _Ibula_3 |   .0018619   .0024307     0.77   0.444    -.0029195    .0066432
      _Ibula_4 |   .0008077   .0069206     0.12   0.907    -.0128059    .0144212
      _Ibula_5 |   .0016955    .002931     0.58   0.563    -.0040701     .007461
      _Ibula_6 |  -.0211387   .0046818    -4.52   0.000    -.0303481   -.0119292
      _Ibula_7 |    .014458      .0021     6.88   0.000     .0103272    .0185888
      _Ibula_8 |  -.0085308   .0026203    -3.26   0.001    -.0136853   -.0033764
      _Ibula_9 |    .015001   .0031913     4.70   0.000     .0087233    .0212786
     _Ibula_10 |   .0060495   .0051718     1.17   0.243    -.0041239     .016223
     _Ibula_11 |    .030226   .0037687     8.02   0.000     .0228126    .0376394
     _Igrade_2 |  -.0126591   .0023297    -5.43   0.000    -.0172418   -.0080763
     _Igrade_3 |  -.0199455   .0023488    -8.49   0.000    -.0245659   -.0153252
     _Igrade_4 |  -.0236341   .0023698    -9.97   0.000    -.0282958   -.0189724
 _IbulXgra_2_2 |   .0195151   .0071917     2.71   0.007     .0053684    .0336619
 _IbulXgra_2_3 |   .0080475   .0072963     1.10   0.271     -.006305    .0223999
 _IbulXgra_2_4 |   .0097149    .007373     1.32   0.189    -.0047884    .0242181
 _IbulXgra_3_2 |   -.002827   .0034896    -0.81   0.418    -.0096913    .0040373
 _IbulXgra_3_3 |  -.0009767   .0035343    -0.28   0.782    -.0079289    .0059755
 _IbulXgra_3_4 |   .0017165   .0035915     0.48   0.633    -.0053484    .0087814
 _IbulXgra_4_2 |   .0083054    .009875     0.84   0.401    -.0111196    .0277304
 _IbulXgra_4_3 |    .007563   .0100003     0.76   0.450    -.0121084    .0272344
 _IbulXgra_4_4 |   .0085815   .0101113     0.85   0.397    -.0113083    .0284713
 _IbulXgra_5_2 |   .0099894   .0041888     2.38   0.018     .0017497    .0182291
 _IbulXgra_5_3 |   .0087007   .0042396     2.05   0.041     .0003611    .0170403
 _IbulXgra_5_4 |   .0077227   .0043087     1.79   0.074    -.0007529    .0161983
 _IbulXgra_6_2 |   .0297264   .0066759     4.45   0.000     .0165943    .0428585
 _IbulXgra_6_3 |   .0332094    .006777     4.90   0.000     .0198784    .0465405
 _IbulXgra_6_4 |   .0319186   .0068787     4.64   0.000     .0183875    .0454497
 _IbulXgra_7_2 |    .011864   .0030088     3.94   0.000     .0059454    .0177826
 _IbulXgra_7_3 |   .0083603   .0030507     2.74   0.006     .0023593    .0143614
 _IbulXgra_7_4 |   .0107271   .0031005     3.46   0.001     .0046281     .016826
 _IbulXgra_8_2 |   .0303217   .0037321     8.12   0.000     .0229803    .0376631
 _IbulXgra_8_3 |   .0110907   .0037935     2.92   0.004     .0036285     .018553
 _IbulXgra_8_4 |   .0242257   .0038399     6.31   0.000     .0166722    .0317792
 _IbulXgra_9_2 |   .0103511   .0045673     2.27   0.024     .0013668    .0193355
 _IbulXgra_9_3 |   .0053384   .0046132     1.16   0.248    -.0037361    .0144129
 _IbulXgra_9_4 |   .0059938   .0046614     1.29   0.199    -.0031755    .0151631
_IbulXgra_10_2 |   .0103806   .0073747     1.41   0.160    -.0041261    .0248872
_IbulXgra_10_3 |   .0064603   .0073913     0.87   0.383    -.0080791    .0209996
_IbulXgra_10_4 |   .0087928   .0077049     1.14   0.255    -.0063634     .023949
_IbulXgra_11_2 |   .0078008   .0054244     1.44   0.151    -.0028695    .0184711
_IbulXgra_11_3 |   .0041396   .0055076     0.75   0.453    -.0066943    .0149734
_IbulXgra_11_4 |  -.0042357   .0056156    -0.75   0.451    -.0152821    .0068107
   _Iyear_1965 |  -.0019331   .0016151    -1.20   0.232    -.0051102     .001244
   _Iyear_1966 |  -.0077891   .0019885    -3.92   0.000    -.0117006   -.0038776
   _Iyear_1967 |  -.0029726   .0018469    -1.61   0.108    -.0066056    .0006604
   _Iyear_1968 |  -.0032034   .0016958    -1.89   0.060    -.0065392    .0001324
   _Iyear_1969 |  -.0027623   .0016175    -1.71   0.089     -.005944    .0004194
   _Iyear_1970 |  -.0040786   .0015648    -2.61   0.010    -.0071567   -.0010006
   _Iyear_1971 |  -.0043249   .0015508    -2.79   0.006    -.0073754   -.0012744
   _Iyear_1972 |  -.0060248   .0015498    -3.89   0.000    -.0090734   -.0029761
         _cons |   .0423049   .0019967    21.19   0.000     .0383772    .0462327
--------------------------------------------------------------------------------

. xi: reg rq ksj2 i.bula*i.grade i.year [aw=stud]
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.bula*i.grade    _IbulXgra_#_#       (coded as above)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
(sum of wgt is 32,550,503)

      Source |       SS           df       MS      Number of obs   =       387
-------------+----------------------------------   F(52, 334)      =     29.34
       Model |  .070561418        52   .00135695   Prob > F        =    0.0000
    Residual |  .015445072       334  .000046243   R-squared       =    0.8204
-------------+----------------------------------   Adj R-squared   =    0.7925
       Total |  .086006489       386  .000222815   Root MSE        =     .0068

--------------------------------------------------------------------------------
            rq | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          ksj2 |   .0119787   .0014331     8.36   0.000     .0091598    .0147977
      _Ibula_2 |   .0150766   .0047759     3.16   0.002     .0056821    .0244712
      _Ibula_3 |   .0016118   .0023215     0.69   0.488    -.0029548    .0061784
      _Ibula_4 |     .00055    .006611     0.08   0.934    -.0124545    .0135544
      _Ibula_5 |   .0014057   .0027994     0.50   0.616     -.004101    .0069124
      _Ibula_6 |  -.0211188   .0044725    -4.72   0.000    -.0299165   -.0123211
      _Ibula_7 |   .0141672   .0020053     7.06   0.000     .0102226    .0181117
      _Ibula_8 |  -.0086171   .0025027    -3.44   0.001    -.0135401    -.003694
      _Ibula_9 |   .0147127   .0030482     4.83   0.000     .0087167    .0207088
     _Ibula_10 |   .0057433   .0049404     1.16   0.246    -.0039748    .0154615
     _Ibula_11 |   .0299502   .0035998     8.32   0.000      .022869    .0370313
     _Igrade_2 |  -.0126644   .0022256    -5.69   0.000    -.0170423   -.0082866
     _Igrade_3 |  -.0199572   .0022438    -8.89   0.000     -.024371   -.0155435
     _Igrade_4 |  -.0236484   .0022639   -10.45   0.000    -.0281017   -.0191952
 _IbulXgra_2_2 |   .0195027   .0068702     2.84   0.005     .0059883     .033017
 _IbulXgra_2_3 |   .0080318   .0069701     1.15   0.250     -.005679    .0217426
 _IbulXgra_2_4 |   .0096874   .0070433     1.38   0.170    -.0041675    .0235423
 _IbulXgra_3_2 |  -.0031569   .0033336    -0.95   0.344    -.0097143    .0034006
 _IbulXgra_3_3 |  -.0016424   .0033763    -0.49   0.627     -.008284    .0049991
 _IbulXgra_3_4 |   .0006837   .0034311     0.20   0.842    -.0060657     .007433
 _IbulXgra_4_2 |   .0079416   .0094336     0.84   0.400    -.0106151    .0264983
 _IbulXgra_4_3 |   .0068524   .0095534     0.72   0.474    -.0119399    .0256448
 _IbulXgra_4_4 |   .0075125   .0096595     0.78   0.437    -.0114887    .0265136
 _IbulXgra_5_2 |   .0096404   .0040016     2.41   0.017     .0017688    .0175119
 _IbulXgra_5_3 |   .0080125   .0040503     1.98   0.049     .0000452    .0159797
 _IbulXgra_5_4 |    .006672   .0041164     1.62   0.106    -.0014253    .0147693
 _IbulXgra_6_2 |   .0297158   .0063775     4.66   0.000     .0171707    .0422608
 _IbulXgra_6_3 |   .0331878   .0064741     5.13   0.000     .0204527    .0459229
 _IbulXgra_6_4 |    .031882   .0065712     4.85   0.000     .0189559    .0448082
 _IbulXgra_7_2 |   .0115248   .0028744     4.01   0.000     .0058706     .017179
 _IbulXgra_7_3 |   .0076754   .0029148     2.63   0.009     .0019418    .0134091
 _IbulXgra_7_4 |   .0096869   .0029625     3.27   0.001     .0038593    .0155145
 _IbulXgra_8_2 |   .0316076   .0035622     8.87   0.000     .0246004    .0386147
 _IbulXgra_8_3 |   .0135387   .0036124     3.75   0.000     .0064327    .0206446
 _IbulXgra_8_4 |   .0277394   .0036419     7.62   0.000     .0205754    .0349034
 _IbulXgra_9_2 |   .0100173   .0043632     2.30   0.022     .0014345       .0186
 _IbulXgra_9_3 |   .0046659   .0044071     1.06   0.290    -.0040032    .0133351
 _IbulXgra_9_4 |   .0049762   .0044532     1.12   0.265    -.0037837    .0137361
_IbulXgra_10_2 |   .0100278    .007045     1.42   0.156    -.0038304     .023886
_IbulXgra_10_3 |   .0057856    .007061     0.82   0.413    -.0081039    .0196752
_IbulXgra_10_4 |   .0076264   .0073609     1.04   0.301    -.0068531    .0221059
_IbulXgra_11_2 |   .0074473    .005182     1.44   0.152    -.0027462    .0176407
_IbulXgra_11_3 |   .0034497   .0052616     0.66   0.513    -.0069002    .0137997
_IbulXgra_11_4 |  -.0052587   .0053647    -0.98   0.328    -.0158115    .0052942
   _Iyear_1965 |  -.0019253   .0015429    -1.25   0.213    -.0049604    .0011097
   _Iyear_1966 |  -.0088167   .0018097    -4.87   0.000    -.0123765   -.0052569
   _Iyear_1967 |  -.0037571   .0017116    -2.20   0.029     -.007124   -.0003903
   _Iyear_1968 |  -.0037151      .0016    -2.32   0.021    -.0068625   -.0005678
   _Iyear_1969 |  -.0030832   .0015429    -2.00   0.046    -.0061183   -.0000482
   _Iyear_1970 |  -.0041109   .0014948    -2.75   0.006    -.0070514   -.0011704
   _Iyear_1971 |  -.0043168   .0014815    -2.91   0.004     -.007231   -.0014026
   _Iyear_1972 |  -.0060093   .0014805    -4.06   0.000    -.0089216   -.0030969
         _cons |   .0426048   .0019013    22.41   0.000     .0388648    .0463448
--------------------------------------------------------------------------------

. xi: reg rq ksj i.bula*i.grade i.year if ns==0  [aw=stud]
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.bula*i.grade    _IbulXgra_#_#       (coded as above)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
(sum of wgt is 28,671,128)

      Source |       SS           df       MS      Number of obs   =       355
-------------+----------------------------------   F(48, 306)      =     58.56
       Model |  .068139209        48  .001419567   Prob > F        =    0.0000
    Residual |  .007418407       306  .000024243   R-squared       =    0.9018
-------------+----------------------------------   Adj R-squared   =    0.8864
       Total |  .075557616       354   .00021344   Root MSE        =    .00492

--------------------------------------------------------------------------------
            rq | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
           ksj |   .0109966   .0010796    10.19   0.000     .0088722     .013121
      _Ibula_2 |   .0150708   .0033888     4.45   0.000     .0084025    .0217391
      _Ibula_3 |   .0016701   .0016477     1.01   0.312    -.0015722    .0049125
      _Ibula_4 |   .0006339   .0046909     0.14   0.893    -.0085965    .0098644
      _Ibula_5 |    .001494   .0019869     0.75   0.453    -.0024157    .0054037
      _Ibula_6 |  -.0211564   .0031733    -6.67   0.000    -.0274006   -.0149122
      _Ibula_7 |   .0142901   .0014238    10.04   0.000     .0114885    .0170917
      _Ibula_8 |          0  (omitted)
      _Ibula_9 |   .0148429   .0021633     6.86   0.000     .0105861    .0190998
     _Ibula_10 |   .0059292   .0035056     1.69   0.092    -.0009689    .0128273
     _Ibula_11 |   .0300271   .0025546    11.75   0.000     .0250003     .035054
     _Igrade_2 |  -.0126607   .0015791    -8.02   0.000    -.0157679   -.0095535
     _Igrade_3 |  -.0199457    .001592   -12.53   0.000    -.0230783    -.016813
     _Igrade_4 |  -.0236351   .0016063   -14.71   0.000    -.0267958   -.0204744
 _IbulXgra_2_2 |   .0194676   .0048745     3.99   0.000     .0098759    .0290594
 _IbulXgra_2_3 |   .0080135   .0049453     1.62   0.106    -.0017177    .0177447
 _IbulXgra_2_4 |   .0097545   .0049973     1.95   0.052     -.000079     .019588
 _IbulXgra_3_2 |  -.0030275   .0023655    -1.28   0.202    -.0076822    .0016273
 _IbulXgra_3_3 |  -.0013383   .0023966    -0.56   0.577    -.0060542    .0033775
 _IbulXgra_3_4 |   .0010396   .0024368     0.43   0.670    -.0037553    .0058346
 _IbulXgra_4_2 |   .0081129   .0066933     1.21   0.226    -.0050578    .0212836
 _IbulXgra_4_3 |   .0071842   .0067785     1.06   0.290    -.0061542    .0205226
 _IbulXgra_4_4 |   .0078806   .0068542     1.15   0.251    -.0056069     .021368
 _IbulXgra_5_2 |   .0098085   .0028394     3.45   0.001     .0042213    .0153957
 _IbulXgra_5_3 |   .0083088   .0028745     2.89   0.004     .0026526    .0139651
 _IbulXgra_5_4 |   .0070161   .0029224     2.40   0.017     .0012655    .0127667
 _IbulXgra_6_2 |   .0296804   .0045249     6.56   0.000     .0207766    .0385842
 _IbulXgra_6_3 |   .0331551   .0045934     7.22   0.000     .0241164    .0421938
 _IbulXgra_6_4 |   .0318955   .0046624     6.84   0.000     .0227211    .0410698
 _IbulXgra_7_2 |   .0117028   .0020397     5.74   0.000     .0076892    .0157164
 _IbulXgra_7_3 |   .0079878   .0020691     3.86   0.000     .0039164    .0120592
 _IbulXgra_7_4 |   .0100679   .0021043     4.78   0.000     .0059272    .0142086
 _IbulXgra_8_2 |          0  (omitted)
 _IbulXgra_8_3 |          0  (omitted)
 _IbulXgra_8_4 |          0  (omitted)
 _IbulXgra_9_2 |   .0101872   .0030959     3.29   0.001     .0040952    .0162791
 _IbulXgra_9_3 |   .0049739   .0031276     1.59   0.113    -.0011804    .0111282
 _IbulXgra_9_4 |    .005359   .0031612     1.70   0.091    -.0008615    .0115795
_IbulXgra_10_2 |   .0101837   .0049986     2.04   0.042     .0003476    .0200197
_IbulXgra_10_3 |   .0061138   .0050103     1.22   0.223    -.0037452    .0159727
_IbulXgra_10_4 |   .0076865   .0052238     1.47   0.142    -.0025926    .0179655
_IbulXgra_11_2 |   .0076026   .0036768     2.07   0.040     .0003675    .0148376
_IbulXgra_11_3 |   .0037617   .0037337     1.01   0.314    -.0035853    .0111087
_IbulXgra_11_4 |  -.0048699   .0038077    -1.28   0.202    -.0123625    .0026227
   _Iyear_1965 |  -.0011083   .0011705    -0.95   0.344    -.0034116    .0011951
   _Iyear_1966 |  -.0059009   .0014107    -4.18   0.000    -.0086767   -.0031251
   _Iyear_1967 |  -.0006761   .0013249    -0.51   0.610    -.0032833     .001931
   _Iyear_1968 |   .0010761   .0012226     0.88   0.379    -.0013297    .0034819
   _Iyear_1969 |   .0006252   .0011679     0.54   0.593     -.001673    .0029233
   _Iyear_1970 |  -.0008242   .0011356    -0.73   0.469    -.0030588    .0014104
   _Iyear_1971 |  -.0014432   .0011244    -1.28   0.200    -.0036557    .0007692
   _Iyear_1972 |  -.0032096   .0011237    -2.86   0.005    -.0054207   -.0009985
         _cons |   .0398065   .0013852    28.74   0.000     .0370808    .0425322
--------------------------------------------------------------------------------

. 
. sum rq if grade >= 2 [aw=stud]

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
          rq |     290    23832947    .0356094   .0151089   .0063186   .0830906

. xi: reg rq ksj i.bula*i.grade i.year if grade >= 2 [aw=stud]
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.bula*i.grade    _IbulXgra_#_#       (coded as above)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
(sum of wgt is 23,832,947)

      Source |       SS           df       MS      Number of obs   =       290
-------------+----------------------------------   F(41, 248)      =     27.62
       Model |  .054119969        41  .001319999   Prob > F        =    0.0000
    Residual |  .011852505       248  .000047792   R-squared       =    0.8203
-------------+----------------------------------   Adj R-squared   =    0.7906
       Total |  .065972474       289  .000228278   Root MSE        =    .00691

--------------------------------------------------------------------------------
            rq | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
           ksj |   .0081737   .0017333     4.72   0.000     .0047598    .0115876
      _Ibula_2 |   .0250504   .0052082     4.81   0.000     .0147924    .0353084
      _Ibula_3 |   .0039417    .002602     1.51   0.131    -.0011831    .0090666
      _Ibula_4 |   .0096791   .0071015     1.36   0.174    -.0043078    .0236659
      _Ibula_5 |   .0097555    .003092     3.16   0.002     .0036655    .0158454
      _Ibula_6 |   .0108558   .0048379     2.24   0.026     .0013271    .0203845
      _Ibula_7 |   .0230922   .0021831    10.58   0.000     .0187923    .0273921
      _Ibula_8 |   .0159726   .0027358     5.84   0.000     .0105842     .021361
      _Ibula_9 |   .0212709   .0033161     6.41   0.000     .0147396    .0278022
     _Ibula_10 |   .0165703   .0050628     3.27   0.001     .0065987    .0265419
     _Ibula_11 |   .0346874   .0038872     8.92   0.000     .0270312    .0423436
     _Igrade_2 |   .0072599     .00229     3.17   0.002     .0027496    .0117701
     _Igrade_3 |          0  (omitted)
     _Igrade_4 |   -.003671   .0023275    -1.58   0.116    -.0082551    .0009131
 _IbulXgra_2_2 |   .0097737   .0071926     1.36   0.175    -.0043927    .0239402
 _IbulXgra_2_3 |  -.0016899    .007289    -0.23   0.817    -.0160461    .0126662
 _IbulXgra_2_4 |          0  (omitted)
 _IbulXgra_3_2 |  -.0046803   .0034863    -1.34   0.181    -.0115469    .0021862
 _IbulXgra_3_3 |  -.0027331    .003504    -0.78   0.436    -.0096344    .0041682
 _IbulXgra_3_4 |          0  (omitted)
 _IbulXgra_4_2 |  -.0003346   .0097849    -0.03   0.973    -.0196067    .0189374
 _IbulXgra_4_3 |  -.0010088   .0098931    -0.10   0.919     -.020494    .0184763
 _IbulXgra_4_4 |          0  (omitted)
 _IbulXgra_5_2 |   .0021699   .0041701     0.52   0.603    -.0060434    .0103832
 _IbulXgra_5_3 |   .0009508   .0041972     0.23   0.821    -.0073158    .0092175
 _IbulXgra_5_4 |          0  (omitted)
 _IbulXgra_6_2 |  -.0022951   .0066543    -0.34   0.730    -.0154013    .0108111
 _IbulXgra_6_3 |   .0012341   .0067476     0.18   0.855    -.0120558    .0145241
 _IbulXgra_6_4 |          0  (omitted)
 _IbulXgra_7_2 |   .0034552    .002961     1.17   0.244    -.0023767    .0092871
 _IbulXgra_7_3 |          0  (omitted)
 _IbulXgra_7_4 |   .0023604   .0030158     0.78   0.435    -.0035794    .0083002
 _IbulXgra_8_2 |   .0059866   .0036961     1.62   0.107    -.0012932    .0132664
 _IbulXgra_8_3 |  -.0130809   .0037384    -3.50   0.001    -.0204438   -.0057179
 _IbulXgra_8_4 |          0  (omitted)
 _IbulXgra_9_2 |   .0042839   .0045195     0.95   0.344    -.0046176    .0131854
 _IbulXgra_9_3 |  -.0006703   .0045445    -0.15   0.883     -.009621    .0082804
 _IbulXgra_9_4 |          0  (omitted)
_IbulXgra_10_2 |          0  (omitted)
_IbulXgra_10_3 |  -.0038835    .007151    -0.54   0.588    -.0179679    .0102009
_IbulXgra_10_4 |  -.0013498   .0074476    -0.18   0.856    -.0160183    .0133188
_IbulXgra_11_2 |   .0036168   .0053724     0.67   0.501    -.0069645     .014198
_IbulXgra_11_3 |          0  (omitted)
_IbulXgra_11_4 |  -.0083711   .0055336    -1.51   0.132    -.0192699    .0025278
   _Iyear_1965 |  -.0019219    .001817    -1.06   0.291    -.0055006    .0016569
   _Iyear_1966 |  -.0070796   .0022419    -3.16   0.002    -.0114951    -.002664
   _Iyear_1967 |  -.0032359   .0022597    -1.43   0.153    -.0076866    .0012147
   _Iyear_1968 |   -.002872   .0020105    -1.43   0.154    -.0068319     .001088
   _Iyear_1969 |  -.0036656   .0018479    -1.98   0.048    -.0073052   -.0000259
   _Iyear_1970 |   -.006255   .0017575    -3.56   0.000    -.0097166   -.0027934
   _Iyear_1971 |  -.0073122   .0017338    -4.22   0.000    -.0107269   -.0038974
   _Iyear_1972 |  -.0094114   .0017302    -5.44   0.000    -.0128191   -.0060036
         _cons |   .0234225   .0021012    11.15   0.000     .0192841    .0275609
--------------------------------------------------------------------------------

. xi: reg rq ksj2 i.bula*i.grade i.year if grade >= 2 [aw=stud]
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.bula*i.grade    _IbulXgra_#_#       (coded as above)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
(sum of wgt is 23,832,947)

      Source |       SS           df       MS      Number of obs   =       290
-------------+----------------------------------   F(41, 248)      =     33.25
       Model |  .055818618        41   .00136143   Prob > F        =    0.0000
    Residual |  .010153856       248  .000040943   R-squared       =    0.8461
-------------+----------------------------------   Adj R-squared   =    0.8206
       Total |  .065972474       289  .000228278   Root MSE        =     .0064

--------------------------------------------------------------------------------
            rq | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          ksj2 |   .0125145   .0015238     8.21   0.000     .0095132    .0155158
      _Ibula_2 |   .0248358     .00482     5.15   0.000     .0153425    .0343291
      _Ibula_3 |   .0021056   .0023999     0.88   0.381    -.0026212    .0068324
      _Ibula_4 |    .007276    .006428     1.13   0.259    -.0053844    .0199364
      _Ibula_5 |   .0092967   .0027561     3.37   0.001     .0038683    .0147251
      _Ibula_6 |   .0108208   .0044778     2.42   0.016     .0020014    .0196402
      _Ibula_7 |   .0216811   .0020145    10.76   0.000     .0177133    .0256488
      _Ibula_8 |   .0229557   .0023584     9.73   0.000     .0183106    .0276008
      _Ibula_9 |   .0194053   .0030627     6.34   0.000     .0133731    .0254375
     _Ibula_10 |   .0155995   .0046845     3.33   0.001     .0063731     .024826
     _Ibula_11 |   .0332937   .0035943     9.26   0.000     .0262143     .040373
     _Igrade_2 |   .0072731   .0021195     3.43   0.001     .0030986    .0114477
     _Igrade_3 |          0  (omitted)
     _Igrade_4 |  -.0036768   .0021542    -1.71   0.089    -.0079198    .0005661
 _IbulXgra_2_2 |   .0098092   .0066573     1.47   0.142    -.0033028    .0229213
 _IbulXgra_2_3 |  -.0016601   .0067465    -0.25   0.806    -.0149477    .0116275
 _IbulXgra_2_4 |          0  (omitted)
 _IbulXgra_3_2 |  -.0037083    .003226    -1.15   0.251    -.0100621    .0026455
 _IbulXgra_3_3 |   -.002228   .0032429    -0.69   0.493    -.0086153    .0041592
 _IbulXgra_3_4 |          0  (omitted)
 _IbulXgra_4_2 |   .0011371     .00896     0.13   0.899    -.0165104    .0187845
 _IbulXgra_4_3 |          0  (omitted)
 _IbulXgra_4_4 |   .0005153   .0091566     0.06   0.955    -.0175194      .01855
 _IbulXgra_5_2 |    .001681   .0038015     0.44   0.659    -.0058063    .0091684
 _IbulXgra_5_3 |          0  (omitted)
 _IbulXgra_5_4 |  -.0014501   .0038845    -0.37   0.709     -.009101    .0062007
 _IbulXgra_6_2 |  -.0022315    .006159    -0.36   0.717    -.0143621    .0098992
 _IbulXgra_6_3 |   .0012688   .0062454     0.20   0.839    -.0110319    .0135696
 _IbulXgra_6_4 |          0  (omitted)
 _IbulXgra_7_2 |   .0039256   .0027405     1.43   0.153    -.0014721    .0093233
 _IbulXgra_7_3 |          0  (omitted)
 _IbulXgra_7_4 |   .0018767   .0027911     0.67   0.502    -.0036204    .0073739
 _IbulXgra_8_2 |          0  (omitted)
 _IbulXgra_8_3 |  -.0179365    .003384    -5.30   0.000    -.0246015   -.0112715
 _IbulXgra_8_4 |  -.0038454   .0034094    -1.13   0.260    -.0105605    .0028697
 _IbulXgra_9_2 |   .0052229   .0041826     1.25   0.213     -.003015    .0134608
 _IbulXgra_9_3 |  -.0001977   .0042061    -0.05   0.963    -.0084819    .0080865
 _IbulXgra_9_4 |          0  (omitted)
_IbulXgra_10_2 |          0  (omitted)
_IbulXgra_10_3 |  -.0043275   .0066186    -0.65   0.514    -.0173635    .0087084
_IbulXgra_10_4 |  -.0024481    .006893    -0.36   0.723    -.0160245    .0111282
_IbulXgra_11_2 |   .0040736   .0049724     0.82   0.413    -.0057199    .0138671
_IbulXgra_11_3 |          0  (omitted)
_IbulXgra_11_4 |  -.0088338   .0051215    -1.72   0.086     -.018921    .0012534
   _Iyear_1965 |  -.0019085   .0016818    -1.13   0.258    -.0052209    .0014039
   _Iyear_1966 |  -.0088399   .0019261    -4.59   0.000    -.0126335   -.0050464
   _Iyear_1967 |  -.0052455   .0019711    -2.66   0.008    -.0091278   -.0013632
   _Iyear_1968 |  -.0041951   .0018105    -2.32   0.021    -.0077611   -.0006292
   _Iyear_1969 |  -.0043715   .0017043    -2.56   0.011    -.0077282   -.0010148
   _Iyear_1970 |  -.0063109   .0016267    -3.88   0.000    -.0095148   -.0031069
   _Iyear_1971 |  -.0073024   .0016047    -4.55   0.000     -.010463   -.0041418
   _Iyear_1972 |  -.0093885   .0016014    -5.86   0.000    -.0125426   -.0062343
         _cons |   .0240581   .0019318    12.45   0.000     .0202533    .0278629
--------------------------------------------------------------------------------

. xi: reg rq ksj i.bula*i.grade i.year if grade >= 2 & ns==0  [aw=stud]
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.bula*i.grade    _IbulXgra_#_#       (coded as above)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
(sum of wgt is 20,965,344)

      Source |       SS           df       MS      Number of obs   =       266
-------------+----------------------------------   F(38, 227)      =     82.27
       Model |  .053511987        38   .00140821   Prob > F        =    0.0000
    Residual |  .003885572       227  .000017117   R-squared       =    0.9323
-------------+----------------------------------   Adj R-squared   =    0.9210
       Total |  .057397559       265  .000216595   Root MSE        =    .00414

--------------------------------------------------------------------------------
            rq | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
           ksj |   .0106765   .0010536    10.13   0.000     .0086004    .0127527
      _Ibula_2 |   .0232712   .0029935     7.77   0.000     .0173726    .0291697
      _Ibula_3 |   .0028681   .0015298     1.87   0.062    -.0001463    .0058825
      _Ibula_4 |   .0079556   .0040725     1.95   0.052    -.0000691    .0159803
      _Ibula_5 |   .0086344   .0018165     4.75   0.000     .0050551    .0122136
      _Ibula_6 |   .0120354   .0027568     4.37   0.000     .0066031    .0174676
      _Ibula_7 |   .0223804    .001283    17.44   0.000     .0198522    .0249085
      _Ibula_8 |          0  (omitted)
      _Ibula_9 |   .0202547   .0019474    10.40   0.000     .0164174    .0240919
     _Ibula_10 |   .0161315   .0029679     5.44   0.000     .0102833    .0219797
     _Ibula_11 |   .0339521   .0022801    14.89   0.000     .0294592     .038445
     _Igrade_2 |   .0109328   .0013537     8.08   0.000     .0082653    .0136003
     _Igrade_3 |    .003672   .0013641     2.69   0.008     .0009841    .0063599
     _Igrade_4 |          0  (omitted)
 _IbulXgra_2_2 |    .011446    .004173     2.74   0.007     .0032234    .0196687
 _IbulXgra_2_3 |          0  (omitted)
 _IbulXgra_2_4 |   .0017516   .0042719     0.41   0.682     -.006666    .0101693
 _IbulXgra_3_2 |  -.0040826   .0020444    -2.00   0.047    -.0081109   -.0000542
 _IbulXgra_3_3 |  -.0023537   .0020539    -1.15   0.253    -.0064009    .0016935
 _IbulXgra_3_4 |          0  (omitted)
 _IbulXgra_4_2 |   .0009232   .0056737     0.16   0.871    -.0102567     .012103
 _IbulXgra_4_3 |          0  (omitted)
 _IbulXgra_4_4 |   .0006277   .0057982     0.11   0.914    -.0107975     .012053
 _IbulXgra_5_2 |     .00281   .0024449     1.15   0.252    -.0020075    .0076275
 _IbulXgra_5_3 |   .0013174   .0024601     0.54   0.593    -.0035302    .0061649
 _IbulXgra_5_4 |          0  (omitted)
 _IbulXgra_6_2 |  -.0035293   .0038431    -0.92   0.359    -.0111021    .0040435
 _IbulXgra_6_3 |          0  (omitted)
 _IbulXgra_6_4 |  -.0012103   .0039546    -0.31   0.760    -.0090028    .0065822
 _IbulXgra_7_2 |   .0037316   .0017357     2.15   0.033     .0003114    .0071517
 _IbulXgra_7_3 |          0  (omitted)
 _IbulXgra_7_4 |    .002019   .0017678     1.14   0.255    -.0014644    .0055024
 _IbulXgra_8_2 |          0  (omitted)
 _IbulXgra_8_3 |          0  (omitted)
 _IbulXgra_8_4 |          0  (omitted)
 _IbulXgra_9_2 |   .0048753   .0026496     1.84   0.067    -.0003456    .0100962
 _IbulXgra_9_3 |  -.0003462   .0026636    -0.13   0.897    -.0055948    .0049024
 _IbulXgra_9_4 |          0  (omitted)
_IbulXgra_10_2 |          0  (omitted)
_IbulXgra_10_3 |  -.0040982   .0041912    -0.98   0.329    -.0123567    .0041603
_IbulXgra_10_4 |  -.0023357   .0043656    -0.54   0.593    -.0109379    .0062666
_IbulXgra_11_2 |   .0038604   .0031488     1.23   0.221    -.0023443     .010065
_IbulXgra_11_3 |          0  (omitted)
_IbulXgra_11_4 |  -.0086812   .0032433    -2.68   0.008     -.015072   -.0022904
   _Iyear_1965 |  -.0012702   .0011392    -1.11   0.266    -.0035149    .0009745
   _Iyear_1966 |  -.0055611   .0013709    -4.06   0.000    -.0082625   -.0028597
   _Iyear_1967 |   -.001513   .0013814    -1.10   0.275     -.004235    .0012089
   _Iyear_1968 |   .0007997   .0012473     0.64   0.522    -.0016581    .0032575
   _Iyear_1969 |  -.0012488   .0011529    -1.08   0.280    -.0035205    .0010229
   _Iyear_1970 |  -.0035817    .001104    -3.24   0.001     -.005757   -.0014063
   _Iyear_1971 |  -.0049761    .001087    -4.58   0.000    -.0071181   -.0028341
   _Iyear_1972 |  -.0071515   .0010849    -6.59   0.000    -.0092893   -.0050136
         _cons |    .017757   .0012745    13.93   0.000     .0152455    .0202684
--------------------------------------------------------------------------------

. 
. xi: reg rq ksj i.bula*i.grade i.bula*i.year i.grad*i.year [aw=stud]
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.bula*i.grade    _IbulXgra_#_#       (coded as above)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
i.bula*i.year     _IbulXyea_#_#       (coded as above)
i.grade*i.year    _IgraXyea_#_#       (coded as above)
(sum of wgt is 32,550,503)

      Source |       SS           df       MS      Number of obs   =       387
-------------+----------------------------------   F(155, 231)     =     19.46
       Model |  .079887407       155  .000515403   Prob > F        =    0.0000
    Residual |  .006119082       231   .00002649   R-squared       =    0.9289
-------------+----------------------------------   Adj R-squared   =    0.8811
       Total |  .086006489       386  .000222815   Root MSE        =    .00515

-----------------------------------------------------------------------------------
               rq | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
              ksj |   .0101083   .0027251     3.71   0.000     .0047389    .0154776
         _Ibula_2 |   .0389998   .0067308     5.79   0.000     .0257382    .0522615
         _Ibula_3 |   -.001583   .0034361    -0.46   0.645    -.0083531    .0051871
         _Ibula_4 |    .004445   .0094604     0.47   0.639    -.0141946    .0230847
         _Ibula_5 |   .0102665   .0040509     2.53   0.012      .002285     .018248
         _Ibula_6 |  -.0077236   .0066325    -1.16   0.245    -.0207915    .0053442
         _Ibula_7 |   .0149909   .0029139     5.14   0.000     .0092497    .0207321
         _Ibula_8 |   .0153935   .0035589     4.33   0.000     .0083816    .0224055
         _Ibula_9 |   .0122802    .004263     2.88   0.004     .0038809    .0206795
        _Ibula_10 |   .0099017   .0071732     1.38   0.169    -.0042317     .024035
        _Ibula_11 |   .0407896   .0052269     7.80   0.000     .0304911    .0510882
        _Igrade_2 |  -.0102647   .0028292    -3.63   0.000     -.015839   -.0046905
        _Igrade_3 |  -.0136292   .0028768    -4.74   0.000    -.0192973   -.0079611
        _Igrade_4 |  -.0186099   .0029612    -6.28   0.000    -.0244443   -.0127755
    _IbulXgra_2_2 |   .0199638   .0052158     3.83   0.000     .0096872    .0302403
    _IbulXgra_2_3 |   .0083106   .0052898     1.57   0.118    -.0021119    .0187331
    _IbulXgra_2_4 |   .0097071   .0053469     1.82   0.071    -.0008278    .0202421
    _IbulXgra_3_2 |  -.0024699   .0025432    -0.97   0.332    -.0074807    .0025409
    _IbulXgra_3_3 |   -.000367   .0026216    -0.14   0.889    -.0055323    .0047983
    _IbulXgra_3_4 |   .0019407   .0027363     0.71   0.479    -.0034505    .0073319
    _IbulXgra_4_2 |    .008636   .0071667     1.21   0.229    -.0054845    .0227564
    _IbulXgra_4_3 |   .0076307   .0072806     1.05   0.296    -.0067142    .0219757
    _IbulXgra_4_4 |   .0086709   .0073831     1.17   0.241     -.005876    .0232177
    _IbulXgra_5_2 |   .0102571   .0030463     3.37   0.001     .0042551    .0162592
    _IbulXgra_5_3 |   .0086276   .0031232     2.76   0.006     .0024741    .0147812
    _IbulXgra_5_4 |    .007551   .0032344     2.33   0.020     .0011783    .0139237
    _IbulXgra_6_2 |   .0297157   .0048287     6.15   0.000     .0202019    .0392296
    _IbulXgra_6_3 |   .0333627   .0049048     6.80   0.000     .0236989    .0430265
    _IbulXgra_6_4 |   .0319307   .0049818     6.41   0.000     .0221152    .0417462
    _IbulXgra_7_2 |   .0124121   .0021971     5.65   0.000     .0080832     .016741
    _IbulXgra_7_3 |   .0085648   .0022803     3.76   0.000     .0040721    .0130576
    _IbulXgra_7_4 |   .0107064   .0023993     4.46   0.000     .0059791    .0154337
    _IbulXgra_8_2 |   .0317863   .0027732    11.46   0.000     .0263224    .0372503
    _IbulXgra_8_3 |   .0104432   .0028477     3.67   0.000     .0048324    .0160541
    _IbulXgra_8_4 |   .0249134   .0029432     8.46   0.000     .0191145    .0307123
    _IbulXgra_9_2 |   .0106646   .0033192     3.21   0.002     .0041248    .0172044
    _IbulXgra_9_3 |   .0057291   .0033905     1.69   0.092    -.0009512    .0124094
    _IbulXgra_9_4 |   .0063905   .0034821     1.84   0.068    -.0004703    .0132513
   _IbulXgra_10_2 |   .0103352   .0053451     1.93   0.054    -.0001962    .0208667
   _IbulXgra_10_3 |   .0057391   .0053852     1.07   0.288    -.0048713    .0163495
   _IbulXgra_10_4 |   .0080653   .0056917     1.42   0.158     -.003149    .0192795
   _IbulXgra_11_2 |   .0082445   .0039397     2.09   0.037     .0004822    .0160068
   _IbulXgra_11_3 |   .0038924   .0040318     0.97   0.335    -.0040513    .0118361
   _IbulXgra_11_4 |  -.0048223   .0041558    -1.16   0.247    -.0130104    .0033659
         _Ibula_2 |          0  (omitted)
         _Ibula_3 |          0  (omitted)
         _Ibula_4 |          0  (omitted)
         _Ibula_5 |          0  (omitted)
         _Ibula_6 |          0  (omitted)
         _Ibula_7 |          0  (omitted)
         _Ibula_8 |          0  (omitted)
         _Ibula_9 |          0  (omitted)
        _Ibula_10 |          0  (omitted)
        _Ibula_11 |          0  (omitted)
      _Iyear_1965 |   .0007063    .003373     0.21   0.834    -.0059394    .0073521
      _Iyear_1966 |    -.00109   .0034471    -0.32   0.752    -.0078818    .0057019
      _Iyear_1967 |          0  (omitted)
      _Iyear_1968 |   .0019632     .00344     0.57   0.569    -.0048147    .0087411
      _Iyear_1969 |   .0044617   .0033287     1.34   0.181    -.0020967    .0110201
      _Iyear_1970 |   .0077525   .0032707     2.37   0.019     .0013083    .0141967
      _Iyear_1971 |    .009424   .0032718     2.88   0.004     .0029776    .0158704
      _Iyear_1972 |   .0092416   .0032789     2.82   0.005     .0027812     .015702
 _IbulXyea_2_1965 |  -.0145671   .0084639    -1.72   0.087    -.0312434    .0021092
 _IbulXyea_2_1966 |  -.0270047   .0082832    -3.26   0.001     -.043325   -.0106844
 _IbulXyea_2_1967 |          0  (omitted)
 _IbulXyea_2_1968 |  -.0283969   .0079528    -3.57   0.000    -.0440662   -.0127277
 _IbulXyea_2_1969 |   -.028631   .0078485    -3.65   0.000    -.0440949   -.0131671
 _IbulXyea_2_1970 |  -.0288257   .0077984    -3.70   0.000    -.0441907   -.0134607
 _IbulXyea_2_1971 |  -.0259622   .0078245    -3.32   0.001    -.0413787   -.0105456
 _IbulXyea_2_1972 |  -.0297814   .0077893    -3.82   0.000    -.0451285   -.0144342
 _IbulXyea_3_1965 |   .0006012   .0041724     0.14   0.886    -.0076196    .0088221
 _IbulXyea_3_1966 |  -.0057266   .0049873    -1.15   0.252    -.0155529    .0040997
 _IbulXyea_3_1967 |   -.002586   .0045947    -0.56   0.574     -.011639    .0064669
 _IbulXyea_3_1968 |   .0102582   .0042984     2.39   0.018     .0017892    .0187272
 _IbulXyea_3_1969 |   .0057879   .0041189     1.41   0.161    -.0023276    .0139033
 _IbulXyea_3_1970 |    .004171   .0040098     1.04   0.299    -.0037294    .0120714
 _IbulXyea_3_1971 |   .0057383   .0039929     1.44   0.152    -.0021289    .0136055
 _IbulXyea_3_1972 |   .0042888   .0039981     1.07   0.285    -.0035887    .0121662
 _IbulXyea_4_1965 |  -.0027346   .0115501    -0.24   0.813    -.0254915    .0200223
 _IbulXyea_4_1966 |  -.0087255   .0119185    -0.73   0.465    -.0322084    .0147573
 _IbulXyea_4_1967 |  -.0063448   .0118261    -0.54   0.592    -.0296457    .0169561
 _IbulXyea_4_1968 |  -.0059579   .0116233    -0.51   0.609    -.0288592    .0169433
 _IbulXyea_4_1969 |  -.0043612   .0115247    -0.38   0.705    -.0270682    .0183458
 _IbulXyea_4_1970 |  -.0036687   .0112337    -0.33   0.744    -.0258023    .0184649
 _IbulXyea_4_1971 |  -.0031029   .0110503    -0.28   0.779    -.0248751    .0186693
 _IbulXyea_4_1972 |   -.002466   .0110189    -0.22   0.823    -.0241764    .0192444
 _IbulXyea_5_1965 |  -.0058675   .0049715    -1.18   0.239    -.0156627    .0039278
 _IbulXyea_5_1966 |  -.0128901    .005625    -2.29   0.023     -.023973   -.0018072
 _IbulXyea_5_1967 |  -.0078619   .0053261    -1.48   0.141    -.0183558     .002632
 _IbulXyea_5_1968 |  -.0091023   .0050515    -1.80   0.073    -.0190553    .0008507
 _IbulXyea_5_1969 |  -.0096591   .0048943    -1.97   0.050    -.0193023   -.0000159
 _IbulXyea_5_1970 |  -.0106237   .0047788    -2.22   0.027    -.0200393    -.001208
 _IbulXyea_5_1971 |  -.0113436   .0047219    -2.40   0.017    -.0206471   -.0020401
 _IbulXyea_5_1972 |  -.0104671    .004718    -2.22   0.027    -.0197629   -.0011712
 _IbulXyea_6_1965 |  -.0102223   .0082502    -1.24   0.217    -.0264776    .0060329
 _IbulXyea_6_1966 |  -.0114948   .0080813    -1.42   0.156    -.0274172    .0044277
 _IbulXyea_6_1967 |  -.0162052   .0079107    -2.05   0.042    -.0317915   -.0006189
 _IbulXyea_6_1968 |  -.0163387   .0078021    -2.09   0.037    -.0317112   -.0009663
 _IbulXyea_6_1969 |  -.0145053   .0077415    -1.87   0.062    -.0297582    .0007476
 _IbulXyea_6_1970 |  -.0178233   .0077328    -2.30   0.022    -.0330592   -.0025874
 _IbulXyea_6_1971 |  -.0156701   .0078163    -2.00   0.046    -.0310704   -.0002698
 _IbulXyea_6_1972 |  -.0139084   .0078499    -1.77   0.078    -.0293749    .0015582
 _IbulXyea_7_1965 |  -.0009136    .003521    -0.26   0.795    -.0078511    .0060238
 _IbulXyea_7_1966 |  -.0082653   .0044475    -1.86   0.064    -.0170282    .0004976
 _IbulXyea_7_1967 |   8.34e-06   .0040467     0.00   0.998    -.0079649    .0079815
 _IbulXyea_7_1968 |   .0043842   .0037252     1.18   0.240    -.0029555    .0117239
 _IbulXyea_7_1969 |   .0018361    .003526     0.52   0.603    -.0051111    .0087832
 _IbulXyea_7_1970 |  -.0011763   .0034288    -0.34   0.732     -.007932    .0055795
 _IbulXyea_7_1971 |  -.0018249   .0034031    -0.54   0.592    -.0085299    .0048801
 _IbulXyea_7_1972 |   -.002446   .0034041    -0.72   0.473    -.0091531    .0042611
 _IbulXyea_8_1965 |   -.007451   .0043116    -1.73   0.085    -.0159461    .0010441
 _IbulXyea_8_1966 |  -.0367125   .0052277    -7.02   0.000    -.0470126   -.0264124
 _IbulXyea_8_1967 |  -.0290466   .0047981    -6.05   0.000    -.0385001    -.019593
 _IbulXyea_8_1968 |  -.0406269   .0045123    -9.00   0.000    -.0495173   -.0317364
 _IbulXyea_8_1969 |  -.0305891   .0043961    -6.96   0.000    -.0392506   -.0219275
 _IbulXyea_8_1970 |  -.0283797   .0041467    -6.84   0.000    -.0365499   -.0202095
 _IbulXyea_8_1971 |  -.0251126   .0041389    -6.07   0.000    -.0332674   -.0169578
 _IbulXyea_8_1972 |   -.024828   .0041416    -5.99   0.000    -.0329881   -.0166678
 _IbulXyea_9_1965 |   .0026583   .0052012     0.51   0.610    -.0075895    .0129062
 _IbulXyea_9_1966 |  -.0065721   .0059003    -1.11   0.266    -.0181975    .0050532
 _IbulXyea_9_1967 |   .0008573   .0056393     0.15   0.879    -.0102538    .0119683
 _IbulXyea_9_1968 |   .0038272   .0053806     0.71   0.478     -.006774    .0144285
 _IbulXyea_9_1969 |   .0144519   .0052191     2.77   0.006     .0041688    .0247351
 _IbulXyea_9_1970 |   .0033745   .0050937     0.66   0.508    -.0066616    .0134105
 _IbulXyea_9_1971 |   .0000518   .0050366     0.01   0.992    -.0098718    .0099753
 _IbulXyea_9_1972 |   .0012786   .0050533     0.25   0.800    -.0086777     .011235
_IbulXyea_10_1965 |   .0034058   .0086415     0.39   0.694    -.0136204     .020432
_IbulXyea_10_1966 |  -.0085754   .0091017    -0.94   0.347    -.0265084    .0093577
_IbulXyea_10_1967 |  -.0008423       .009    -0.09   0.926     -.018575    .0168904
_IbulXyea_10_1968 |  -.0040366   .0088806    -0.45   0.650    -.0215339    .0134608
_IbulXyea_10_1969 |   -.008454   .0087719    -0.96   0.336    -.0257371    .0088291
_IbulXyea_10_1970 |  -.0063631   .0086281    -0.74   0.462    -.0233629    .0106366
_IbulXyea_10_1971 |  -.0058221   .0085786    -0.68   0.498    -.0227244    .0110802
_IbulXyea_10_1972 |  -.0031042   .0086128    -0.36   0.719    -.0200739    .0138655
_IbulXyea_11_1965 |  -.0068737     .00647    -1.06   0.289    -.0196215    .0058741
_IbulXyea_11_1966 |  -.0142299   .0070138    -2.03   0.044     -.028049   -.0004108
_IbulXyea_11_1967 |  -.0050716   .0067423    -0.75   0.453    -.0183558    .0082126
_IbulXyea_11_1968 |  -.0086521   .0065016    -1.33   0.185    -.0214621    .0041578
_IbulXyea_11_1969 |  -.0164696   .0063545    -2.59   0.010    -.0289897   -.0039494
_IbulXyea_11_1970 |  -.0174713    .006193    -2.82   0.005    -.0296733   -.0052693
_IbulXyea_11_1971 |  -.0120573   .0061027    -1.98   0.049    -.0240814   -.0000331
_IbulXyea_11_1972 |  -.0129681   .0060757    -2.13   0.034    -.0249389   -.0009973
        _Igrade_2 |          0  (omitted)
        _Igrade_3 |          0  (omitted)
        _Igrade_4 |          0  (omitted)
      _Iyear_1965 |          0  (omitted)
      _Iyear_1966 |          0  (omitted)
      _Iyear_1967 |   .0056005   .0036893     1.52   0.130    -.0016685    .0128695
      _Iyear_1968 |          0  (omitted)
      _Iyear_1969 |          0  (omitted)
      _Iyear_1970 |          0  (omitted)
      _Iyear_1971 |          0  (omitted)
      _Iyear_1972 |          0  (omitted)
 _IgraXyea_2_1965 |   .0001757   .0032208     0.05   0.957    -.0061702    .0065216
 _IgraXyea_2_1966 |   .0036101   .0033886     1.07   0.288    -.0030663    .0102866
 _IgraXyea_2_1967 |  -.0010574   .0039905    -0.26   0.791    -.0089198     .006805
 _IgraXyea_2_1968 |    .002895   .0032022     0.90   0.367    -.0034142    .0092043
 _IgraXyea_2_1969 |  -.0017526   .0031295    -0.56   0.576    -.0079186    .0044134
 _IgraXyea_2_1970 |  -.0059234   .0031147    -1.90   0.058    -.0120602    .0002135
 _IgraXyea_2_1971 |  -.0083796   .0031169    -2.69   0.008    -.0145208   -.0022383
 _IgraXyea_2_1972 |  -.0100367   .0031277    -3.21   0.002    -.0161991   -.0038743
 _IgraXyea_3_1965 |   .0001399   .0032571     0.04   0.966    -.0062775    .0065572
 _IgraXyea_3_1966 |   .0042767    .003415     1.25   0.212    -.0024517    .0110052
 _IgraXyea_3_1967 |  -.0076333   .0038845    -1.97   0.051    -.0152868    .0000202
 _IgraXyea_3_1968 |  -.0040327   .0038994    -1.03   0.302    -.0117156    .0036502
 _IgraXyea_3_1969 |  -.0062023    .003216    -1.93   0.055    -.0125388    .0001341
 _IgraXyea_3_1970 |  -.0114964    .003148    -3.65   0.000    -.0176989   -.0052939
 _IgraXyea_3_1971 |  -.0137812   .0031418    -4.39   0.000    -.0199714   -.0075909
 _IgraXyea_3_1972 |  -.0150583   .0031431    -4.79   0.000     -.021251   -.0088656
 _IgraXyea_4_1965 |  -.0010849   .0033174    -0.33   0.744    -.0076211    .0054513
 _IgraXyea_4_1966 |   .0032162   .0034692     0.93   0.355    -.0036191    .0100515
 _IgraXyea_4_1967 |  -.0043485   .0039193    -1.11   0.268    -.0120706    .0033736
 _IgraXyea_4_1968 |  -.0033797   .0038514    -0.88   0.381    -.0109681    .0042086
 _IgraXyea_4_1969 |  -.0050403   .0039013    -1.29   0.198    -.0127269    .0026463
 _IgraXyea_4_1970 |  -.0064238   .0032456    -1.98   0.049    -.0128185   -.0000291
 _IgraXyea_4_1971 |  -.0118946   .0031884    -3.73   0.000    -.0181767   -.0056125
 _IgraXyea_4_1972 |  -.0139481   .0031812    -4.38   0.000    -.0202159   -.0076802
            _cons |   .0341476   .0026606    12.83   0.000     .0289054    .0393897
-----------------------------------------------------------------------------------

. xi: reg rq ksj2 i.bula*i.grade i.bula*i.year i.grad*i.year [aw=stud]
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.bula*i.grade    _IbulXgra_#_#       (coded as above)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
i.bula*i.year     _IbulXyea_#_#       (coded as above)
i.grade*i.year    _IgraXyea_#_#       (coded as above)
(sum of wgt is 32,550,503)

      Source |       SS           df       MS      Number of obs   =       387
-------------+----------------------------------   F(155, 231)     =     22.88
       Model |  .080746213       155  .000520943   Prob > F        =    0.0000
    Residual |  .005260276       231  .000022772   R-squared       =    0.9388
-------------+----------------------------------   Adj R-squared   =    0.8978
       Total |  .086006489       386  .000222815   Root MSE        =    .00477

-----------------------------------------------------------------------------------
               rq | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
             ksj2 |   .0170622    .002328     7.33   0.000     .0124755     .021649
         _Ibula_2 |   .0392021     .00624     6.28   0.000     .0269075    .0514968
         _Ibula_3 |  -.0004776   .0031815    -0.15   0.881    -.0067461    .0057909
         _Ibula_4 |   .0055654   .0087698     0.63   0.526    -.0117137    .0228446
         _Ibula_5 |   .0113844   .0037522     3.03   0.003     .0039916    .0187772
         _Ibula_6 |  -.0077629   .0061494    -1.26   0.208    -.0198791    .0043532
         _Ibula_7 |   .0161024   .0026964     5.97   0.000     .0107896    .0214151
         _Ibula_8 |   .0141632    .003276     4.32   0.000     .0077084    .0206179
         _Ibula_9 |   .0133904   .0039489     3.39   0.001     .0056098    .0211709
        _Ibula_10 |   .0108618   .0066484     1.63   0.104    -.0022374    .0239611
        _Ibula_11 |   .0419052   .0048434     8.65   0.000     .0323624     .051448
        _Igrade_2 |  -.0098673   .0026196    -3.77   0.000    -.0150286   -.0047059
        _Igrade_3 |  -.0128537   .0026535    -4.84   0.000    -.0180818   -.0076256
        _Igrade_4 |  -.0174531   .0027157    -6.43   0.000    -.0228038   -.0121023
    _IbulXgra_2_2 |   .0195448   .0048342     4.04   0.000     .0100201    .0290695
    _IbulXgra_2_3 |   .0080559   .0049028     1.64   0.102    -.0016041    .0177159
    _IbulXgra_2_4 |   .0094937   .0049561     1.92   0.057    -.0002713    .0192587
    _IbulXgra_3_2 |  -.0032323   .0023553    -1.37   0.171    -.0078728    .0014082
    _IbulXgra_3_3 |  -.0018969   .0024204    -0.78   0.434    -.0066657    .0028719
    _IbulXgra_3_4 |  -.0003885   .0025148    -0.15   0.877    -.0053434    .0045663
    _IbulXgra_4_2 |    .007884   .0066438     1.19   0.237    -.0052061    .0209742
    _IbulXgra_4_3 |   .0061145   .0067466     0.91   0.366    -.0071783    .0194072
    _IbulXgra_4_4 |   .0063514   .0068372     0.93   0.354    -.0071199    .0198228
    _IbulXgra_5_2 |   .0095031   .0028221     3.37   0.001     .0039428    .0150633
    _IbulXgra_5_3 |   .0071127   .0028865     2.46   0.014     .0014254       .0128
    _IbulXgra_5_4 |   .0052331   .0029796     1.76   0.080    -.0006377    .0111038
    _IbulXgra_6_2 |   .0297346    .004477     6.64   0.000     .0209136    .0385556
    _IbulXgra_6_3 |   .0334018   .0045476     7.34   0.000     .0244418    .0423618
    _IbulXgra_6_4 |   .0319975   .0046189     6.93   0.000     .0228969    .0410981
    _IbulXgra_7_2 |   .0116642   .0020337     5.74   0.000     .0076572    .0156711
    _IbulXgra_7_3 |   .0070686   .0021014     3.36   0.001     .0029282     .011209
    _IbulXgra_7_4 |   .0084195   .0021983     3.83   0.000     .0040882    .0127507
    _IbulXgra_8_2 |   .0325898   .0025574    12.74   0.000      .027551    .0376285
    _IbulXgra_8_3 |   .0121564   .0025851     4.70   0.000     .0070631    .0172498
    _IbulXgra_8_4 |   .0274441   .0026059    10.53   0.000     .0223098    .0325784
    _IbulXgra_9_2 |   .0099093   .0030753     3.22   0.001     .0038501    .0159685
    _IbulXgra_9_3 |   .0042244   .0031351     1.35   0.179    -.0019526    .0104014
    _IbulXgra_9_4 |   .0041056   .0032104     1.28   0.202    -.0022198     .010431
   _IbulXgra_10_2 |   .0095688   .0049545     1.93   0.055     -.000193    .0193307
   _IbulXgra_10_3 |   .0042159   .0049878     0.85   0.399    -.0056115    .0140433
   _IbulXgra_10_4 |    .005649   .0052671     1.07   0.285    -.0047287    .0160266
   _IbulXgra_11_2 |   .0074979   .0036509     2.05   0.041     .0003046    .0146912
   _IbulXgra_11_3 |   .0023847    .003731     0.64   0.523    -.0049666    .0097359
   _IbulXgra_11_4 |  -.0071258   .0038381    -1.86   0.065     -.014688    .0004364
         _Ibula_2 |          0  (omitted)
         _Ibula_3 |          0  (omitted)
         _Ibula_4 |          0  (omitted)
         _Ibula_5 |          0  (omitted)
         _Ibula_6 |          0  (omitted)
         _Ibula_7 |          0  (omitted)
         _Ibula_8 |          0  (omitted)
         _Ibula_9 |          0  (omitted)
        _Ibula_10 |          0  (omitted)
        _Ibula_11 |          0  (omitted)
      _Iyear_1965 |   .0007068   .0031273     0.23   0.821    -.0054549    .0068686
      _Iyear_1966 |  -.0012686   .0031958    -0.40   0.692    -.0075652    .0050281
      _Iyear_1967 |   .0078636   .0033007     2.38   0.018     .0013602     .014367
      _Iyear_1968 |   .0037243   .0031458     1.18   0.238    -.0024737    .0099224
      _Iyear_1969 |   .0055434   .0030799     1.80   0.073    -.0005249    .0116118
      _Iyear_1970 |   .0077626   .0030325     2.56   0.011     .0017877    .0137375
      _Iyear_1971 |   .0094053   .0030335     3.10   0.002     .0034283    .0153822
      _Iyear_1972 |   .0092178   .0030401     3.03   0.003     .0032279    .0152078
 _IbulXyea_2_1965 |   -.014551   .0078475    -1.85   0.065    -.0300128    .0009108
 _IbulXyea_2_1966 |  -.0269453     .00768    -3.51   0.001     -.042077   -.0118135
 _IbulXyea_2_1967 |          0  (omitted)
 _IbulXyea_2_1968 |   -.028415   .0073736    -3.85   0.000     -.042943   -.0138869
 _IbulXyea_2_1969 |  -.0286289    .007277    -3.93   0.000    -.0429666   -.0142912
 _IbulXyea_2_1970 |  -.0288088   .0072304    -3.98   0.000    -.0430548   -.0145627
 _IbulXyea_2_1971 |  -.0259315   .0072547    -3.57   0.000    -.0402253   -.0116377
 _IbulXyea_2_1972 |  -.0297611    .007222    -4.12   0.000    -.0439906   -.0155316
 _IbulXyea_3_1965 |   .0005875   .0038686     0.15   0.879    -.0070346    .0082097
 _IbulXyea_3_1966 |  -.0126427    .004518    -2.80   0.006    -.0215445    -.003741
 _IbulXyea_3_1967 |  -.0076002   .0042011    -1.81   0.072    -.0158776    .0006772
 _IbulXyea_3_1968 |   .0070719   .0039592     1.79   0.075    -.0007289    .0148727
 _IbulXyea_3_1969 |   .0042699   .0038127     1.12   0.264    -.0032423    .0117821
 _IbulXyea_3_1970 |   .0041706   .0037178     1.12   0.263    -.0031544    .0114957
 _IbulXyea_3_1971 |   .0057698   .0037021     1.56   0.120    -.0015245     .013064
 _IbulXyea_3_1972 |   .0043237    .003707     1.17   0.245    -.0029801    .0116274
 _IbulXyea_4_1965 |  -.0027745   .0107089    -0.26   0.796    -.0238741    .0183251
 _IbulXyea_4_1966 |  -.0156737   .0110071    -1.42   0.156    -.0373608    .0060134
 _IbulXyea_4_1967 |  -.0115444    .010944    -1.05   0.293    -.0331071    .0100184
 _IbulXyea_4_1968 |  -.0093108   .0107682    -0.86   0.388    -.0305272    .0119055
 _IbulXyea_4_1969 |  -.0059349   .0106832    -0.56   0.579     -.026984    .0151141
 _IbulXyea_4_1970 |  -.0037193   .0104156    -0.36   0.721     -.024241    .0168025
 _IbulXyea_4_1971 |  -.0031083   .0102455    -0.30   0.762    -.0232949    .0170782
 _IbulXyea_4_1972 |  -.0024611   .0102164    -0.24   0.810    -.0225905    .0176682
 _IbulXyea_5_1965 |  -.0059209   .0046094    -1.28   0.200    -.0150028    .0031609
 _IbulXyea_5_1966 |  -.0198465   .0051221    -3.87   0.000    -.0299386   -.0097544
 _IbulXyea_5_1967 |  -.0130924   .0048909    -2.68   0.008    -.0227289   -.0034558
 _IbulXyea_5_1968 |  -.0124606   .0046627    -2.67   0.008    -.0216474   -.0032738
 _IbulXyea_5_1969 |   -.011267   .0045325    -2.49   0.014    -.0201974   -.0023366
 _IbulXyea_5_1970 |  -.0106713   .0044308    -2.41   0.017    -.0194013   -.0019413
 _IbulXyea_5_1971 |  -.0113339    .004378    -2.59   0.010    -.0199599   -.0027079
 _IbulXyea_5_1972 |  -.0104537   .0043744    -2.39   0.018    -.0190725   -.0018348
 _IbulXyea_6_1965 |  -.0101974   .0076493    -1.33   0.184    -.0252688     .004874
 _IbulXyea_6_1966 |  -.0114485   .0074928    -1.53   0.128    -.0262114    .0033144
 _IbulXyea_6_1967 |  -.0162371   .0073345    -2.21   0.028    -.0306882    -.001786
 _IbulXyea_6_1968 |  -.0163684   .0072339    -2.26   0.025    -.0306212   -.0021155
 _IbulXyea_6_1969 |  -.0145181   .0071777    -2.02   0.044    -.0286602   -.0003761
 _IbulXyea_6_1970 |  -.0178363   .0071697    -2.49   0.014    -.0319627     -.00371
 _IbulXyea_6_1971 |  -.0156668    .007247    -2.16   0.032    -.0299456   -.0013881
 _IbulXyea_6_1972 |  -.0139063   .0072782    -1.91   0.057    -.0282464    .0004339
 _IbulXyea_7_1965 |  -.0009652   .0032646    -0.30   0.768    -.0073974    .0054669
 _IbulXyea_7_1966 |  -.0152179    .004005    -3.80   0.000     -.023109   -.0073269
 _IbulXyea_7_1967 |  -.0052144   .0036895    -1.41   0.159    -.0124838     .002055
 _IbulXyea_7_1968 |   .0010281   .0034253     0.30   0.764    -.0057208     .007777
 _IbulXyea_7_1969 |    .000222   .0032619     0.07   0.946    -.0062048    .0066489
 _IbulXyea_7_1970 |  -.0012456   .0031791    -0.39   0.696    -.0075094    .0050182
 _IbulXyea_7_1971 |   -.001835   .0031552    -0.58   0.561    -.0080517    .0043817
 _IbulXyea_7_1972 |  -.0024395   .0031562    -0.77   0.440    -.0086581    .0037791
 _IbulXyea_8_1965 |  -.0074226   .0039976    -1.86   0.065     -.015299    .0004538
 _IbulXyea_8_1966 |  -.0272247   .0041526    -6.56   0.000    -.0354065   -.0190428
 _IbulXyea_8_1967 |    -.02312   .0040867    -5.66   0.000     -.031172    -.015068
 _IbulXyea_8_1968 |  -.0376614   .0040434    -9.31   0.000    -.0456281   -.0296947
 _IbulXyea_8_1969 |  -.0310475   .0040632    -7.64   0.000    -.0390531   -.0230418
 _IbulXyea_8_1970 |  -.0283901   .0038447    -7.38   0.000    -.0359653   -.0208149
 _IbulXyea_8_1971 |  -.0250986   .0038375    -6.54   0.000    -.0326595   -.0175376
 _IbulXyea_8_1972 |  -.0248324     .00384    -6.47   0.000    -.0323983   -.0172666
 _IbulXyea_9_1965 |   .0026248   .0048224     0.54   0.587    -.0068767    .0121264
 _IbulXyea_9_1966 |  -.0135171   .0053816    -2.51   0.013    -.0241204   -.0029137
 _IbulXyea_9_1967 |  -.0043577   .0051837    -0.84   0.401     -.014571    .0058557
 _IbulXyea_9_1968 |   .0005053   .0049686     0.10   0.919    -.0092842    .0102948
 _IbulXyea_9_1969 |   .0128498    .004834     2.66   0.008     .0033254    .0223742
 _IbulXyea_9_1970 |   .0033291   .0047228     0.70   0.482    -.0059761    .0126343
 _IbulXyea_9_1971 |   .0000651   .0046698     0.01   0.989    -.0091357     .009266
 _IbulXyea_9_1972 |   .0012951   .0046852     0.28   0.782    -.0079362    .0105264
_IbulXyea_10_1965 |   .0035571   .0080122     0.44   0.657    -.0122292    .0193435
_IbulXyea_10_1966 |  -.0153393   .0083792    -1.83   0.068    -.0318486    .0011701
_IbulXyea_10_1967 |  -.0058614   .0083146    -0.70   0.482    -.0222436    .0105207
_IbulXyea_10_1968 |  -.0072232   .0082208    -0.88   0.381    -.0234205    .0089742
_IbulXyea_10_1969 |  -.0098883   .0081295    -1.22   0.225    -.0259057    .0061291
_IbulXyea_10_1970 |  -.0062186   .0079997    -0.78   0.438    -.0219804    .0095432
_IbulXyea_10_1971 |  -.0056253   .0079539    -0.71   0.480    -.0212968    .0100461
_IbulXyea_10_1972 |  -.0028932   .0079856    -0.36   0.717    -.0186272    .0128408
_IbulXyea_11_1965 |  -.0069207   .0059988    -1.15   0.250    -.0187401    .0048987
_IbulXyea_11_1966 |  -.0212057   .0064288    -3.30   0.001    -.0338722   -.0085392
_IbulXyea_11_1967 |  -.0102555   .0062133    -1.65   0.100    -.0224975    .0019865
_IbulXyea_11_1968 |   -.011971   .0060115    -1.99   0.048    -.0238154   -.0001266
_IbulXyea_11_1969 |  -.0180653   .0058877    -3.07   0.002    -.0296658   -.0064648
_IbulXyea_11_1970 |  -.0175376    .005742    -3.05   0.003     -.028851   -.0062243
_IbulXyea_11_1971 |  -.0120739   .0056583    -2.13   0.034    -.0232224   -.0009255
_IbulXyea_11_1972 |  -.0129731   .0056332    -2.30   0.022    -.0240722   -.0018741
        _Igrade_2 |          0  (omitted)
        _Igrade_3 |          0  (omitted)
        _Igrade_4 |          0  (omitted)
      _Iyear_1965 |          0  (omitted)
      _Iyear_1966 |          0  (omitted)
      _Iyear_1967 |          0  (omitted)
      _Iyear_1968 |          0  (omitted)
      _Iyear_1969 |          0  (omitted)
      _Iyear_1970 |          0  (omitted)
      _Iyear_1971 |          0  (omitted)
      _Iyear_1972 |          0  (omitted)
 _IgraXyea_2_1965 |   .0001915   .0029862     0.06   0.949    -.0056922    .0060753
 _IgraXyea_2_1966 |   .0038811   .0031414     1.24   0.218    -.0023085    .0100706
 _IgraXyea_2_1967 |  -.0046312   .0035339    -1.31   0.191     -.011594    .0023317
 _IgraXyea_2_1968 |    .002654   .0029692     0.89   0.372    -.0031963    .0085042
 _IgraXyea_2_1969 |  -.0017576   .0029016    -0.61   0.545    -.0074746    .0039593
 _IgraXyea_2_1970 |  -.0059057   .0028879    -2.05   0.042    -.0115956   -.0002158
 _IgraXyea_2_1971 |  -.0083704   .0028899    -2.90   0.004    -.0140644   -.0026764
 _IgraXyea_2_1972 |  -.0100234   .0028999    -3.46   0.001     -.015737   -.0043098
 _IgraXyea_3_1965 |   .0001567   .0030199     0.05   0.959    -.0057932    .0061067
 _IgraXyea_3_1966 |   .0045235   .0031659     1.43   0.154    -.0017142    .0107613
 _IgraXyea_3_1967 |  -.0104404   .0033549    -3.11   0.002    -.0170505   -.0038303
 _IgraXyea_3_1968 |  -.0081701   .0034925    -2.34   0.020    -.0150512    -.001289
 _IgraXyea_3_1969 |  -.0063277   .0029818    -2.12   0.035    -.0122027   -.0004527
 _IgraXyea_3_1970 |  -.0114858   .0029188    -3.94   0.000    -.0172365    -.005735
 _IgraXyea_3_1971 |  -.0137692    .002913    -4.73   0.000    -.0195086   -.0080298
 _IgraXyea_3_1972 |  -.0150461   .0029142    -5.16   0.000    -.0207878   -.0093044
 _IgraXyea_4_1965 |  -.0010348   .0030758    -0.34   0.737     -.007095    .0050255
 _IgraXyea_4_1966 |   .0035057   .0032163     1.09   0.277    -.0028314    .0098428
 _IgraXyea_4_1967 |  -.0072363   .0033994    -2.13   0.034    -.0139341   -.0005385
 _IgraXyea_4_1968 |  -.0064047   .0033332    -1.92   0.056    -.0129721    .0001627
 _IgraXyea_4_1969 |  -.0095195    .003523    -2.70   0.007    -.0164609   -.0025781
 _IgraXyea_4_1970 |  -.0064833   .0030092    -2.15   0.032    -.0124124   -.0005543
 _IgraXyea_4_1971 |   -.011872   .0029562    -4.02   0.000    -.0176966   -.0060475
 _IgraXyea_4_1972 |  -.0139007   .0029495    -4.71   0.000    -.0197121   -.0080893
            _cons |   .0335779   .0024589    13.66   0.000     .0287333    .0384226
-----------------------------------------------------------------------------------

. xi: reg rq ksj i.bula*i.grade i.bula*i.year i.grad*i.year if ns==0  [aw=stud]
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.bula*i.grade    _IbulXgra_#_#       (coded as above)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
i.bula*i.year     _IbulXyea_#_#       (coded as above)
i.grade*i.year    _IgraXyea_#_#       (coded as above)
(sum of wgt is 28,671,128)

      Source |       SS           df       MS      Number of obs   =       355
-------------+----------------------------------   F(143, 211)     =     75.72
       Model |  .074113415       143  .000518276   Prob > F        =    0.0000
    Residual |    .0014442       211  6.8446e-06   R-squared       =    0.9809
-------------+----------------------------------   Adj R-squared   =    0.9679
       Total |  .075557616       354   .00021344   Root MSE        =    .00262

-----------------------------------------------------------------------------------
               rq | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
              ksj |   .0131383   .0013774     9.54   0.000     .0104231    .0158536
         _Ibula_2 |   .0389102   .0033528    11.61   0.000      .032301    .0455194
         _Ibula_3 |  -.0010915   .0017119    -0.64   0.524    -.0044661    .0022832
         _Ibula_4 |   .0049239   .0047124     1.04   0.297    -.0043655    .0142133
         _Ibula_5 |   .0107314   .0020181     5.32   0.000     .0067531    .0147096
         _Ibula_6 |  -.0077652   .0033037    -2.35   0.020    -.0142776   -.0012528
         _Ibula_7 |   .0154341   .0014519    10.63   0.000     .0125721    .0182961
         _Ibula_8 |          0  (omitted)
         _Ibula_9 |   .0127488   .0021237     6.00   0.000     .0085624    .0169353
        _Ibula_10 |   .0107756   .0035742     3.01   0.003     .0037299    .0178214
        _Ibula_11 |   .0412417   .0026038    15.84   0.000     .0361089    .0463745
        _Igrade_2 |  -.0081866   .0014716    -5.56   0.000    -.0110874   -.0052857
        _Igrade_3 |  -.0134321    .001494    -8.99   0.000    -.0163772   -.0104869
        _Igrade_4 |  -.0158134    .001537   -10.29   0.000    -.0188433   -.0127835
    _IbulXgra_2_2 |   .0200495   .0025981     7.72   0.000     .0149279     .025171
    _IbulXgra_2_3 |   .0084343   .0026353     3.20   0.002     .0032393    .0136292
    _IbulXgra_2_4 |    .009717   .0026637     3.65   0.000     .0044661    .0149679
    _IbulXgra_3_2 |  -.0027622    .001267    -2.18   0.030    -.0052598   -.0002646
    _IbulXgra_3_3 |  -.0010023   .0013068    -0.77   0.444    -.0035784    .0015737
    _IbulXgra_3_4 |   .0009897   .0013651     0.72   0.469    -.0017014    .0036808
    _IbulXgra_4_2 |   .0082567   .0035699     2.31   0.022     .0012195    .0152939
    _IbulXgra_4_3 |    .007047   .0036269     1.94   0.053    -.0001025    .0141965
    _IbulXgra_4_4 |   .0076734   .0036784     2.09   0.038     .0004223    .0149244
    _IbulXgra_5_2 |   .0099054   .0015176     6.53   0.000     .0069138    .0128971
    _IbulXgra_5_3 |   .0080442   .0015564     5.17   0.000     .0049761    .0111124
    _IbulXgra_5_4 |   .0065945   .0016129     4.09   0.000     .0034151    .0097739
    _IbulXgra_6_2 |   .0297785   .0024052    12.38   0.000     .0250372    .0345198
    _IbulXgra_6_3 |   .0333027   .0024431    13.63   0.000     .0284867    .0381187
    _IbulXgra_6_4 |   .0319729   .0024814    12.88   0.000     .0270812    .0368645
    _IbulXgra_7_2 |   .0120424   .0010947    11.00   0.000     .0098844    .0142003
    _IbulXgra_7_3 |   .0080454   .0011368     7.08   0.000     .0058045    .0102864
    _IbulXgra_7_4 |    .009732   .0011974     8.13   0.000     .0073716    .0120925
    _IbulXgra_8_2 |          0  (omitted)
    _IbulXgra_8_3 |          0  (omitted)
    _IbulXgra_8_4 |          0  (omitted)
    _IbulXgra_9_2 |   .0102906   .0016535     6.22   0.000     .0070311    .0135502
    _IbulXgra_9_3 |   .0051806   .0016895     3.07   0.002       .00185    .0085111
    _IbulXgra_9_4 |   .0053965    .001736     3.11   0.002     .0019743    .0088187
   _IbulXgra_10_2 |   .0098591   .0026626     3.70   0.000     .0046104    .0151078
   _IbulXgra_10_3 |   .0051839   .0026829     1.93   0.055    -.0001048    .0104726
   _IbulXgra_10_4 |   .0071531   .0028366     2.52   0.012     .0015614    .0127448
   _IbulXgra_11_2 |   .0079219   .0019625     4.04   0.000     .0040532    .0117906
   _IbulXgra_11_3 |   .0033144   .0020088     1.65   0.100    -.0006456    .0072743
   _IbulXgra_11_4 |  -.0057999   .0020714    -2.80   0.006    -.0098833   -.0017166
         _Ibula_2 |          0  (omitted)
         _Ibula_3 |          0  (omitted)
         _Ibula_4 |          0  (omitted)
         _Ibula_5 |          0  (omitted)
         _Ibula_6 |          0  (omitted)
         _Ibula_7 |          0  (omitted)
         _Ibula_8 |          0  (omitted)
         _Ibula_9 |          0  (omitted)
        _Ibula_10 |          0  (omitted)
        _Ibula_11 |          0  (omitted)
      _Iyear_1965 |    .001226   .0017181     0.71   0.476    -.0021608    .0046128
      _Iyear_1966 |   -.000162   .0017358    -0.09   0.926    -.0035837    .0032596
      _Iyear_1967 |    .006617   .0018667     3.54   0.000     .0029373    .0102967
      _Iyear_1968 |   .0032149   .0017469     1.84   0.067    -.0002287    .0066585
      _Iyear_1969 |   .0068258   .0016944     4.03   0.000     .0034857    .0101659
      _Iyear_1970 |   .0093382   .0016671     5.60   0.000     .0060519    .0126245
      _Iyear_1971 |   .0109924   .0016681     6.59   0.000      .007704    .0142807
      _Iyear_1972 |   .0108236   .0016716     6.47   0.000     .0075284    .0141187
 _IbulXyea_2_1965 |  -.0145406   .0042159    -3.45   0.001    -.0228513   -.0062299
 _IbulXyea_2_1966 |  -.0270121   .0041259    -6.55   0.000    -.0351454   -.0188788
 _IbulXyea_2_1967 |          0  (omitted)
 _IbulXyea_2_1968 |  -.0282585   .0039613    -7.13   0.000    -.0360674   -.0204497
 _IbulXyea_2_1969 |  -.0286449   .0039094    -7.33   0.000    -.0363513   -.0209384
 _IbulXyea_2_1970 |  -.0287692   .0038844    -7.41   0.000    -.0364264    -.021112
 _IbulXyea_2_1971 |  -.0259462   .0038974    -6.66   0.000    -.0336291   -.0182633
 _IbulXyea_2_1972 |  -.0297389   .0038799    -7.66   0.000    -.0373873   -.0220906
 _IbulXyea_3_1965 |   .0005468   .0020783     0.26   0.793    -.0035501    .0046438
 _IbulXyea_3_1966 |  -.0087425   .0024949    -3.50   0.001    -.0136607   -.0038244
 _IbulXyea_3_1967 |  -.0048104   .0022949    -2.10   0.037    -.0093343   -.0002866
 _IbulXyea_3_1968 |   .0088199   .0021437     4.11   0.000     .0045941    .0130457
 _IbulXyea_3_1969 |   .0050891   .0020523     2.48   0.014     .0010434    .0091347
 _IbulXyea_3_1970 |   .0041268   .0019973     2.07   0.040     .0001895    .0080641
 _IbulXyea_3_1971 |   .0056913   .0019889     2.86   0.005     .0017706     .009612
 _IbulXyea_3_1972 |    .004262   .0019915     2.14   0.033     .0003362    .0081878
 _IbulXyea_4_1965 |  -.0027555   .0057531    -0.48   0.632    -.0140965    .0085855
 _IbulXyea_4_1966 |  -.0118601   .0059413    -2.00   0.047    -.0235719   -.0001482
 _IbulXyea_4_1967 |  -.0087296   .0058936    -1.48   0.140    -.0203475    .0028884
 _IbulXyea_4_1968 |  -.0075861   .0057909    -1.31   0.192    -.0190016    .0038293
 _IbulXyea_4_1969 |  -.0049938   .0057408    -0.87   0.385    -.0163105    .0063228
 _IbulXyea_4_1970 |  -.0037042   .0055956    -0.66   0.509    -.0147346    .0073262
 _IbulXyea_4_1971 |  -.0031411   .0055042    -0.57   0.569    -.0139913    .0077092
 _IbulXyea_4_1972 |   -.002463   .0054886    -0.45   0.654    -.0132825    .0083564
 _IbulXyea_5_1965 |  -.0058662   .0024763    -2.37   0.019    -.0107477   -.0009847
 _IbulXyea_5_1966 |  -.0159743   .0028116    -5.68   0.000    -.0215167   -.0104318
 _IbulXyea_5_1967 |  -.0102462   .0026596    -3.85   0.000    -.0154891   -.0050034
 _IbulXyea_5_1968 |  -.0107066   .0025191    -4.25   0.000    -.0156724   -.0057408
 _IbulXyea_5_1969 |  -.0102897   .0024386    -4.22   0.000    -.0150968   -.0054826
 _IbulXyea_5_1970 |  -.0106654   .0023804    -4.48   0.000    -.0153579   -.0059729
 _IbulXyea_5_1971 |  -.0113641    .002352    -4.83   0.000    -.0160006   -.0067277
 _IbulXyea_5_1972 |   -.010464   .0023501    -4.45   0.000    -.0150966   -.0058314
 _IbulXyea_6_1965 |  -.0101817   .0041095    -2.48   0.014    -.0182825   -.0020808
 _IbulXyea_6_1966 |  -.0115131   .0040253    -2.86   0.005    -.0194481   -.0035781
 _IbulXyea_6_1967 |  -.0161489   .0039404    -4.10   0.000    -.0239165   -.0083814
 _IbulXyea_6_1968 |  -.0162081   .0038863    -4.17   0.000    -.0238691   -.0085472
 _IbulXyea_6_1969 |  -.0145152   .0038561    -3.76   0.000    -.0221165   -.0069138
 _IbulXyea_6_1970 |  -.0177756   .0038518    -4.61   0.000    -.0253685   -.0101827
 _IbulXyea_6_1971 |   -.015644   .0038933    -4.02   0.000    -.0233188   -.0079692
 _IbulXyea_6_1972 |  -.0138712   .0039101    -3.55   0.000     -.021579   -.0061635
 _IbulXyea_7_1965 |  -.0009221   .0017538    -0.53   0.600    -.0043794    .0025352
 _IbulXyea_7_1966 |  -.0112255   .0022276    -5.04   0.000    -.0156168   -.0068342
 _IbulXyea_7_1967 |   -.002321   .0020244    -1.15   0.253    -.0063117    .0016697
 _IbulXyea_7_1968 |   .0028122   .0018594     1.51   0.132    -.0008533    .0064776
 _IbulXyea_7_1969 |   .0011826   .0017573     0.67   0.502    -.0022815    .0046468
 _IbulXyea_7_1970 |  -.0012053    .001708    -0.71   0.481    -.0045723    .0021617
 _IbulXyea_7_1971 |  -.0018589   .0016951    -1.10   0.274    -.0052005    .0014826
 _IbulXyea_7_1972 |  -.0024281   .0016956    -1.43   0.154    -.0057706    .0009144
 _IbulXyea_8_1965 |          0  (omitted)
 _IbulXyea_8_1966 |          0  (omitted)
 _IbulXyea_8_1967 |          0  (omitted)
 _IbulXyea_8_1968 |          0  (omitted)
 _IbulXyea_8_1969 |          0  (omitted)
 _IbulXyea_8_1970 |          0  (omitted)
 _IbulXyea_8_1971 |          0  (omitted)
 _IbulXyea_8_1972 |          0  (omitted)
 _IbulXyea_9_1965 |   .0026331   .0025907     1.02   0.311     -.002474    .0077401
 _IbulXyea_9_1966 |  -.0095233   .0029482    -3.23   0.001     -.015335   -.0037115
 _IbulXyea_9_1967 |  -.0014766   .0028152    -0.52   0.600     -.007026    .0040729
 _IbulXyea_9_1968 |   .0022824   .0026827     0.85   0.396    -.0030058    .0075707
 _IbulXyea_9_1969 |   .0138361   .0026003     5.32   0.000     .0087102     .018962
 _IbulXyea_9_1970 |   .0033326   .0025373     1.31   0.190     -.001669    .0083342
 _IbulXyea_9_1971 |   .0000461   .0025088     0.02   0.985    -.0048993    .0049915
 _IbulXyea_9_1972 |   .0012927   .0025171     0.51   0.608    -.0036691    .0062544
_IbulXyea_10_1965 |   .0029861   .0043055     0.69   0.489    -.0055012    .0114734
_IbulXyea_10_1966 |  -.0119997   .0045399    -2.64   0.009    -.0209491   -.0030503
_IbulXyea_10_1967 |  -.0035971   .0044873    -0.80   0.424    -.0124428    .0052486
_IbulXyea_10_1968 |  -.0060503   .0044258    -1.37   0.173    -.0147748    .0026742
_IbulXyea_10_1969 |  -.0095232   .0043706    -2.18   0.030    -.0181388   -.0009076
_IbulXyea_10_1970 |  -.0067866   .0042988    -1.58   0.116    -.0152608    .0016876
_IbulXyea_10_1971 |  -.0062341   .0042742    -1.46   0.146    -.0146597    .0021916
_IbulXyea_10_1972 |  -.0034882   .0042913    -0.81   0.417    -.0119475     .004971
_IbulXyea_11_1965 |  -.0068711   .0032227    -2.13   0.034     -.013224   -.0005182
_IbulXyea_11_1966 |  -.0173806   .0035015    -4.96   0.000    -.0242831   -.0104781
_IbulXyea_11_1967 |  -.0074119   .0033634    -2.20   0.029    -.0140421   -.0007818
_IbulXyea_11_1968 |  -.0101867   .0032406    -3.14   0.002    -.0165748   -.0037987
_IbulXyea_11_1969 |  -.0171154   .0031657    -5.41   0.000    -.0233559   -.0108748
_IbulXyea_11_1970 |  -.0175135   .0030848    -5.68   0.000    -.0235945   -.0114325
_IbulXyea_11_1971 |  -.0121015   .0030398    -3.98   0.000    -.0180938   -.0061092
_IbulXyea_11_1972 |  -.0129736   .0030263    -4.29   0.000    -.0189393   -.0070079
        _Igrade_2 |          0  (omitted)
        _Igrade_3 |          0  (omitted)
        _Igrade_4 |          0  (omitted)
      _Iyear_1965 |          0  (omitted)
      _Iyear_1966 |          0  (omitted)
      _Iyear_1967 |          0  (omitted)
      _Iyear_1968 |          0  (omitted)
      _Iyear_1969 |          0  (omitted)
      _Iyear_1970 |          0  (omitted)
      _Iyear_1971 |          0  (omitted)
      _Iyear_1972 |          0  (omitted)
 _IgraXyea_2_1965 |  -.0005058   .0017146    -0.29   0.768    -.0038856    .0028741
 _IgraXyea_2_1966 |   .0057773   .0017592     3.28   0.001     .0023094    .0092452
 _IgraXyea_2_1967 |  -.0034819   .0020437    -1.70   0.090    -.0075107    .0005469
 _IgraXyea_2_1968 |  -.0002175   .0017127    -0.13   0.899    -.0035936    .0031586
 _IgraXyea_2_1969 |  -.0066901   .0016671    -4.01   0.000    -.0099764   -.0034038
 _IgraXyea_2_1970 |  -.0090937   .0016584    -5.48   0.000    -.0123627   -.0058246
 _IgraXyea_2_1971 |  -.0111031   .0016606    -6.69   0.000    -.0143765   -.0078296
 _IgraXyea_2_1972 |  -.0128481   .0016669    -7.71   0.000     -.016134   -.0095621
 _IgraXyea_3_1965 |  -.0006553   .0017333    -0.38   0.706    -.0040721    .0027616
 _IgraXyea_3_1966 |   .0013796   .0017718     0.78   0.437    -.0021131    .0048723
 _IgraXyea_3_1967 |  -.0060804   .0020226    -3.01   0.003    -.0100674   -.0020934
 _IgraXyea_3_1968 |  -.0051736    .002001    -2.59   0.010    -.0091181    -.001229
 _IgraXyea_3_1969 |   -.005642   .0017178    -3.28   0.001    -.0090283   -.0022558
 _IgraXyea_3_1970 |  -.0113923   .0016754    -6.80   0.000    -.0146949   -.0080897
 _IgraXyea_3_1971 |  -.0134427   .0016724    -8.04   0.000    -.0167395   -.0101458
 _IgraXyea_3_1972 |  -.0149284   .0016728    -8.92   0.000    -.0182261   -.0116308
 _IgraXyea_4_1965 |  -.0016033    .001768    -0.91   0.366    -.0050885    .0018818
 _IgraXyea_4_1966 |   -.000083   .0018032    -0.05   0.963    -.0036376    .0034717
 _IgraXyea_4_1967 |  -.0076234   .0020393    -3.74   0.000    -.0116434   -.0036035
 _IgraXyea_4_1968 |  -.0041212   .0020008    -2.06   0.041    -.0080653    -.000177
 _IgraXyea_4_1969 |  -.0102129   .0020079    -5.09   0.000    -.0141711   -.0062548
 _IgraXyea_4_1970 |  -.0098598   .0017354    -5.68   0.000    -.0132807   -.0064389
 _IgraXyea_4_1971 |  -.0158542   .0017005    -9.32   0.000    -.0192064    -.012502
 _IgraXyea_4_1972 |  -.0177243   .0016958   -10.45   0.000    -.0210673   -.0143814
            _cons |   .0329045   .0013491    24.39   0.000     .0302449     .035564
-----------------------------------------------------------------------------------

. 
. /* standard errors */
. 
. xi: reg rq ksj i.bula i.grade i.year [aw=stud], cluster(bula)
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
(sum of wgt is 32,550,503)

Linear regression                               Number of obs     =        387
                                                F(9, 10)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7192
                                                Root MSE          =     .00815

                                  (Std. err. adjusted for 11 clusters in bula)
------------------------------------------------------------------------------
             |               Robust
          rq | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         ksj |   .0094378   .0026157     3.61   0.005     .0036097     .015266
    _Ibula_2 |   .0242494   .0001518   159.79   0.000     .0239112    .0245875
    _Ibula_3 |   .0011946   .0006304     1.90   0.087      -.00021    .0025993
    _Ibula_4 |   .0066321   .0006184    10.72   0.000     .0052541    .0080101
    _Ibula_5 |   .0080297   .0006502    12.35   0.000     .0065809    .0094784
    _Ibula_6 |   .0019847   .0000569    34.89   0.000     .0018579    .0021114
    _Ibula_7 |   .0218809   .0005978    36.60   0.000     .0205488    .0232129
    _Ibula_8 |   .0075954   .0004613    16.47   0.000     .0065675    .0086232
    _Ibula_9 |   .0201883    .000585    34.51   0.000     .0188847    .0214918
   _Ibula_10 |   .0121785   .0006612    18.42   0.000     .0107053    .0136518
   _Ibula_11 |   .0321975   .0006366    50.58   0.000     .0307791    .0336158
   _Igrade_2 |   -.002923   .0040076    -0.73   0.483    -.0118526    .0060066
   _Igrade_3 |   -.014093    .002052    -6.87   0.000    -.0186651   -.0095208
   _Igrade_4 |  -.0155246   .0032651    -4.75   0.001    -.0227998   -.0082495
 _Iyear_1965 |  -.0019527   .0012469    -1.57   0.148    -.0047309    .0008255
 _Iyear_1966 |  -.0077939   .0030471    -2.56   0.028    -.0145833   -.0010045
 _Iyear_1967 |  -.0036312   .0032656    -1.11   0.292    -.0109075     .003645
 _Iyear_1968 |  -.0031355   .0050328    -0.62   0.547    -.0143494    .0080783
 _Iyear_1969 |  -.0030201   .0044501    -0.68   0.513    -.0129355    .0068953
 _Iyear_1970 |  -.0040425   .0040232    -1.00   0.339    -.0130068    .0049218
 _Iyear_1971 |  -.0043295   .0036569    -1.18   0.264    -.0124775    .0038185
 _Iyear_1972 |  -.0060078   .0035082    -1.71   0.118    -.0138246    .0018089
       _cons |   .0366045   .0018129    20.19   0.000     .0325652    .0406439
------------------------------------------------------------------------------

. xi: reg rq ksj2 i.bula i.grade i.year [aw=stud], cluster(bula)
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
(sum of wgt is 32,550,503)

Linear regression                               Number of obs     =        387
                                                F(9, 10)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7294
                                                Root MSE          =       .008

                                  (Std. err. adjusted for 11 clusters in bula)
------------------------------------------------------------------------------
             |               Robust
          rq | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ksj2 |    .011005   .0013151     8.37   0.000     .0080747    .0139353
    _Ibula_2 |   .0242487   .0001354   179.09   0.000      .023947    .0245504
    _Ibula_3 |   .0008218   .0003155     2.60   0.026     .0001189    .0015248
    _Ibula_4 |   .0062368   .0003227    19.33   0.000     .0055178    .0069558
    _Ibula_5 |   .0076244   .0003307    23.05   0.000     .0068874    .0083613
    _Ibula_6 |   .0019868   .0000585    33.99   0.000     .0018566    .0021171
    _Ibula_7 |    .021479   .0003174    67.68   0.000     .0207719    .0221862
    _Ibula_8 |   .0093909   .0001019    92.13   0.000     .0091638     .009618
    _Ibula_9 |   .0197908   .0003247    60.95   0.000     .0190673    .0205143
   _Ibula_10 |   .0117491   .0003402    34.53   0.000      .010991    .0125071
   _Ibula_11 |   .0318112   .0003142   101.25   0.000     .0311112    .0325113
   _Igrade_2 |  -.0028982   .0040135    -0.72   0.487    -.0118409    .0060446
   _Igrade_3 |  -.0140491   .0020557    -6.83   0.000    -.0186294   -.0094687
   _Igrade_4 |  -.0154728   .0032659    -4.74   0.001    -.0227497   -.0081959
 _Iyear_1965 |  -.0019413   .0012414    -1.56   0.149    -.0047073    .0008248
 _Iyear_1966 |  -.0077888   .0030285    -2.57   0.028    -.0145366   -.0010409
 _Iyear_1967 |  -.0036773    .003398    -1.08   0.305    -.0112486     .003894
 _Iyear_1968 |  -.0032035   .0051772    -0.62   0.550    -.0147391    .0083321
 _Iyear_1969 |  -.0031759   .0046042    -0.69   0.506    -.0134347    .0070828
 _Iyear_1970 |  -.0040472   .0040292    -1.00   0.339    -.0130248    .0049304
 _Iyear_1971 |  -.0043229   .0036526    -1.18   0.264    -.0124615    .0038156
 _Iyear_1972 |  -.0060006   .0035025    -1.71   0.117    -.0138047    .0018034
       _cons |   .0366037   .0018812    19.46   0.000     .0324121    .0407952
------------------------------------------------------------------------------

. xi: reg rq ksj i.bula i.grade i.year if ns==0  [aw=stud], cluster(bula)
i.bula            _Ibula_1-11         (_Ibula_1 for bula==bay omitted)
i.grade           _Igrade_1-4         (naturally coded; _Igrade_1 omitted)
i.year            _Iyear_1961-1972    (naturally coded; _Iyear_1961 omitted)
(sum of wgt is 28,671,128)

Linear regression                               Number of obs     =        355
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.8520
                                                Root MSE          =     .00579

                                  (Std. err. adjusted for 10 clusters in bula)
------------------------------------------------------------------------------
             |               Robust
          rq | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         ksj |   .0111956   .0014038     7.98   0.000     .0080201    .0143711
    _Ibula_2 |   .0242344   .0001645   147.35   0.000     .0238624    .0246065
    _Ibula_3 |   .0007754    .000341     2.27   0.049     3.89e-06    .0015469
    _Ibula_4 |   .0062389   .0003538    17.64   0.000     .0054386    .0070391
    _Ibula_5 |   .0076054   .0003604    21.10   0.000     .0067901    .0084207
    _Ibula_6 |   .0019397   .0000297    65.24   0.000     .0018725     .002007
    _Ibula_7 |   .0215068   .0003466    62.05   0.000     .0207227    .0222909
    _Ibula_8 |          0  (omitted)
    _Ibula_9 |   .0198355   .0003539    56.05   0.000     .0190349    .0206361
   _Ibula_10 |   .0117431   .0003662    32.07   0.000     .0109147    .0125714
   _Ibula_11 |   .0317739   .0003424    92.80   0.000     .0309993    .0325485
   _Igrade_2 |  -.0057842    .003006    -1.92   0.086    -.0125842    .0010159
   _Igrade_3 |  -.0149797   .0020523    -7.30   0.000    -.0196223    -.010337
   _Igrade_4 |  -.0180673   .0021948    -8.23   0.000    -.0230323   -.0131023
 _Iyear_1965 |  -.0011404   .0009757    -1.17   0.273    -.0033476    .0010669
 _Iyear_1966 |   -.006053    .002737    -2.21   0.054    -.0122445    .0001386
 _Iyear_1967 |  -.0007387    .001412    -0.52   0.614    -.0039327    .0024554
 _Iyear_1968 |   .0009831    .002405     0.41   0.692    -.0044575    .0064237
 _Iyear_1969 |   .0005586   .0023054     0.24   0.814    -.0046566    .0057739
 _Iyear_1970 |  -.0008272   .0020717    -0.40   0.699    -.0055137    .0038593
 _Iyear_1971 |  -.0014537    .002055    -0.71   0.497    -.0061025    .0031951
 _Iyear_1972 |  -.0032122   .0019206    -1.67   0.129    -.0075569    .0011325
       _cons |    .035597   .0015672    22.71   0.000     .0320518    .0391423
------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\chadi\OneDrive - HandelshÃ¶gskolan i Stockholm\Econ\resources\econometrics\textbooks\datacode\MostlyHarmless\angrist\stabu.log
  log type:  text
 closed on:  23 Jun 2024, 04:48:21
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
